[
  {
    "id": "/2024/07/09/sui-overflow-hackathon-winner",
    "metadata": {
      "permalink": "/blog/2024/07/09/sui-overflow-hackathon-winner",
      "source": "@site/blog/2024-07-09-sui-overflow-hackathon-winner.md",
      "title": "Announcing the Winners of the Sui Overflow Hackathon!",
      "description": "BlockEden.xyz is thrilled to announce the winners of the Sui Overflow Hackathon! After weeks of innovative coding, intense competition, and creative problem-solving, we are proud to present the projects that stood out the most. Congratulations to all the participants for their outstanding contributions. Here are the top winners.",
      "date": "2024-07-09T00:00:00.000Z",
      "formattedDate": "July 9, 2024",
      "tags": [
        {
          "label": "Sui",
          "permalink": "/blog/tags/sui"
        }
      ],
      "readingTime": 2.885,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Announcing the Winners of the Sui Overflow Hackathon!",
        "authors": [
          "dora"
        ],
        "tags": [
          "Sui"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/2024-07-09-sui-overflow-hackathon-winner.webp",
        "description": "BlockEden.xyz is thrilled to announce the winners of the Sui Overflow Hackathon! After weeks of innovative coding, intense competition, and creative problem-solving, we are proud to present the projects that stood out the most. Congratulations to all the participants for their outstanding contributions. Here are the top winners."
      },
      "unlisted": false,
      "nextItem": {
        "title": "Understanding TON: Revolutionizing Blockchain and Formidable Ecosystem",
        "permalink": "/blog/2024/07/08/ton"
      }
    },
    "content": "BlockEden.xyz is thrilled to announce the winners of the Sui Overflow Hackathon! After weeks of innovative coding, intense competition, and creative problem-solving, we are proud to present the projects that stood out the most. Congratulations to all the participants for their outstanding contributions. Here are the top winners:\n\n![](https://tp-misc.b-cdn.net/blockeden/2024-07-09-sui-overflow-hackathon-winner.webp)\n\n### 1st Prize ($1,500 in SUI): Orbital\n**Project Links:**\n- [GitHub Repository](https://github.com/devarogundade/orbital/)\n- [Website](https://myorbital.xyz/)\n\nOrbital is a cutting-edge cross-chain lending platform that leverages wormhole technology and Supra Oracles to revolutionize decentralized finance (DeFi). By enabling seamless and secure lending and borrowing across multiple blockchain networks like SUI and Avalanche, Orbital maximizes liquidity and capital efficiency. The integration of Supra Oracles ensures accurate, real-time data for price feeds and interest rates.\n\nDesigned to feel like a DEX that many blockchain users are accustomed to, Orbital simplifies the user experience with a unified interface where users can manage all transactions from a single dashboard. This intuitive design makes it just one-click to borrow, transforming the traditional DeFi landscape.\n\n### 2nd Prize ($1,000 in SUI): Liquidity Garden\n**Project Link:**\n- [Website](https://liquidity-garden.vercel.app/)\n\nLiquidity Garden is an innovative farm simulation game where players build and manage their own farm garden. Players stake liquidity from FlowX DEX to buy NFT seeds, water them daily, and watch as dynamic NFTs grow and release $OXYGEN tokens. With additional features like raising pets and integrating token swaps directly in the game, Liquidity Garden provides a unique blend of gaming and DeFi, encouraging continuous engagement and interaction.\n\n### 3rd Prize ($100 in SUI): BioWallet, Cocktail OTC Market, SharkyTheSuiBot, Zomdev\n\n#### BioWallet\n**Project Links:**\n- [GitHub Repository](https://github.com/Nilay27/BioWallet)\n- [Website](https://biowallet.my.canva.site/)\n\nBioWallet transforms devices into secure hardware wallets by leveraging biometric-based onboarding. This innovative digital wallet eliminates the need for traditional seed phrases, storing private keys securely in the Secure Enclave. With advanced features like MultiSig and WebAuthn, BioWallet offers top-notch protection and flexibility, bridging the gap between traditional browser wallets and hardware wallets.\n\n#### Cocktail OTC Market\n**Project Links:**\n- [GitHub Repository](https://github.com/0xtail-hackathon/sui-overflow-2024)\n- [Website](https://0xtail-hackathon.github.io/sui-overflow-2024/)\n\nCocktail OTC Market provides a seamless platform for token transactions without the need for a centralized exchange. Sellers can list their tokens with flexible pricing, and buyers can browse and purchase tokens easily. Managed by Sui contracts, Cocktail OTC Market ensures secure and transparent transactions, making it a reliable solution for token trading.\n\n#### SharkyTheSuiBot\n**Project Links:**\n- [GitHub Repository](https://github.com/CryptoInnovators/sharkythesuibot)\n- [Telegram](https://t.me/sharkythesuibot)\n\nSharkyTheSuiBot is the fastest SUI Telegram bot designed to find and exploit arbitrage opportunities across different SUI DEXs. It performs trading activities based on script-logic strategies, offers real-time price fetching, and enables users to provide liquidity in pools directly from the bot. With advanced features like flash loans and real-time charts, SharkyTheSuiBot enhances the user trading experience.\n\n#### Zomdev\n**Project Links:**\n- [GitHub Repository](https://github.com/RevanthGundala/zomdev)\n- [Website](https://zomdev.com)\n\nZomdev is a developer bounty system where companies post bounties for GitHub issues or talent acquisition, and developers can claim these bounties based on project submissions. This platform facilitates a dynamic interaction between companies seeking development assistance and developers looking for opportunities to earn and showcase their skills.\n\n### Honorable Mentions:\n- Cocktail OTC Market\n- SharkyTheSuiBot\n- Zomdev\n\nCongratulations to all the winners and participants! Your innovative solutions and creative ideas have made this hackathon a remarkable success. We look forward to seeing how these projects evolve and continue to impact the blockchain and DeFi landscape.\n\nStay tuned for more updates and future hackathons from BlockEden.xyz!\n\n------\n\n- Twitter: [https://twitter.com/BlockEdenHQ](https://twitter.com/BlockEdenHQ)\n- Discord: [https://discord.gg/4Yfvs2HWey](https://discord.gg/4Yfvs2HWey)\n- Source Link: https://blockeden.xyz/blog/2024/07/08/ton/"
  },
  {
    "id": "/2024/07/08/ton",
    "metadata": {
      "permalink": "/blog/2024/07/08/ton",
      "source": "@site/blog/2024-07-08-ton.md",
      "title": "Understanding TON: Revolutionizing Blockchain and Formidable Ecosystem",
      "description": "Telegram, a popular cross-platform IM tool, created by Pavel Durov, launched TON (Telegram Open Network) in 2013. With 1.8 billion users and 70 billion daily messages, TON has raised $850 million through ICO for its development. This blog delves into TON’s unique technical features and services.",
      "date": "2024-07-08T00:00:00.000Z",
      "formattedDate": "July 8, 2024",
      "tags": [
        {
          "label": "ton",
          "permalink": "/blog/tags/ton"
        }
      ],
      "readingTime": 4.065,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Understanding TON: Revolutionizing Blockchain and Formidable Ecosystem",
        "authors": [
          "dora"
        ],
        "tags": [
          "ton"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/2024-07-08-ton.webp",
        "description": "Telegram, a popular cross-platform IM tool, created by Pavel Durov, launched TON (Telegram Open Network) in 2013. With 1.8 billion users and 70 billion daily messages, TON has raised $850 million through ICO for its development. This blog delves into TON’s unique technical features and services."
      },
      "unlisted": false,
      "prevItem": {
        "title": "Announcing the Winners of the Sui Overflow Hackathon!",
        "permalink": "/blog/2024/07/09/sui-overflow-hackathon-winner"
      },
      "nextItem": {
        "title": "Decentralized AI: Permissionless LLM Inference on BlockEden.xyz",
        "permalink": "/blog/2024/06/20/decentralized-inference-blockeden-xyz"
      }
    },
    "content": "Telegram, a popular cross-platform IM tool, created by Pavel Durov, launched TON (Telegram Open Network) in 2013. With 1.8 billion users and 70 billion daily messages, TON has raised $850 million through ICO for its development. This blog delves into TON’s unique technical features and services.\n\n![](https://tp-misc.b-cdn.net/blockeden/2024-07-08-ton.webp)\n\n## Chain Specs\n\nTON (Telegram Open Network), as outlined in its whitepaper, classifies all public blockchains along five dimensions:\n\n- Single-chain vs. multi-chain\n- Smart contract support\n- Consensus mechanism\n- Sharding support\n- Chain interconnectivity\n\n### Multi-Chain Blockchain System\n\nTON is not a single-chain blockchain but a collection of multiple blockchains, including Masterchain, Workchains, and Shardchains.\n\n- **Masterchain**: The core of TON’s blockchain system, storing essential information and parameters. It records validators, their token holdings, active Workchains, and Shardchains. The Masterchain contains the latest block hashes of all Workchains and Shardchains, ensuring overall coordination and security.\n- **Workchains**: Up to 2^32 Workchains can exist, each handling fund transfers and smart contract interactions. Workchains can have different rules, such as account address formats, transaction formats, smart contract types, and virtual machines. Despite their differences, they must adhere to interoperability standards to enable smooth interaction.\n- **Shardchains**: These are subdivisions of Workchains, designed to improve processing efficiency by distributing tasks among multiple Shardchains. Shardchains follow the rules of their respective Workchains and automatically split or merge based on load, ensuring scalability and performance optimization.\n\n### TON Virtual Machine (TVM)\n\nTVM is a program execution environment running on the blockchain, primarily for executing smart contracts. In TVM, everything is built out of cells and there is TVM that is instantiated for each contract every time.\n\n- **Data Storage**: TVM stores data in cells, each containing up to 128 bytes and references to other cells. This structure allows flexible data handling.\n- **Data Handling**: TVM can manage various data types, using a stack-based structure for efficient computation.\n- **Built-in Functions**: TVM includes tools like hash tables, encryption (elliptic curves), hash functions (e.g., SHA256), and Merkle proof mechanisms, ensuring data security and integrity.\n- **Large Smart Contract Support**: TVM can handle complex and large smart contracts, accommodating dynamic sharding.\n- **Programming Languages**: TVM supports FunC, Fift, and Tact, each tailored for different needs.\n- **Additional Features**: TVM supports closures and efficiently executes complex tasks.\n\n### Infinite Dynamic Sharding\n\nUnlike traditional top-down sharding, TON employs a bottom-up approach. It envisions extreme sharding, where each shard is an account chain. These account chains form larger Shardchains, which connect to the Masterchain, creating a scalable and flexible system.\n\nTON’s dynamic sharding adjusts shard numbers based on load. If a shard’s load is high, it splits; if low, it merges. This dynamic adjustment ensures load balancing, performance optimization, and resource utilization.\n\n### BFT PoS Consensus Mechanism\n\nTON uses a BFT PoS consensus mechanism, combining Byzantine Fault Tolerance (BFT) and Proof of Stake (PoS).\n\n- **BFT**: An algorithm handling Byzantine faults, ensuring system consistency despite up to one-third of nodes failing.\n- **PoS**: Nodes with more tokens have a higher chance of validating transactions and generating blocks, incentivizing security.\n\n**Roles in TON’s PoS Mechanism**:\n\n- **Validators**: Nodes maintaining network security and validating transactions by staking 300,000 TON tokens.\n- **Nominators**: Entities providing stake to validators, sharing in the rewards if the validator performs well.\n\n### Tight-Coupling Chain Interactivity\n\nTON’s tightly-coupled system ensures fast message passing and consistency across all blockchains. Features like embedding Shardchain block hashes in Masterchain blocks and using vertical blockchains for error correction help achieve this.\n\n**Vertical Blockchain Mechanism**: When an invalid block is detected, a corrected block is added vertically, preserving valid parts and reducing disruption.\n\n**Hypercube Routing**: Messages traverse a hypercube network, ensuring accurate and swift delivery across Shardchains.\n\n## TON Services\n\n**TON DNS**: Provides name mapping for blockchain accounts, smart contracts, and services, making DApp usage as convenient as traditional internet domains.\n\n**TON Proxy**: An anonymous network proxy service that hides TON node IP addresses, similar to I2P, creating a decentralized VPN service.\n\n**TON Storage**: A distributed storage system akin to IPFS, using P2P networks for file storage. It supports complex DApp storage needs, such as video streaming.\n\n**TON Pay**: Integrated micropayment channels for instant off-chain transactions, ensuring secure and efficient payments for all DApps on TON.\n\n## Token Economy\n\nTON’s token, Gram, has a total supply of 5 billion, with a portion mined and a fraction allocated to reward DApp developers. A unique pricing mechanism prevents volatility, maintaining economic stability and fostering a sustainable ecosystem.\n\n## Stats\n\n* TVL: $705M\n* Daily Active Wallets: 320K\n* Daily Tx: 4.2M\n\n## Conclusion\n\nTON offers a full-featured blockchain operating system, aiming to surpass platforms like Ethereum and EOS. Its innovative design and comprehensive services make it a formidable player in the blockchain arena. Join the revolution with BlockEden.xyz, where we provide cutting-edge solutions for content creators and developers alike.\n\n\n------\n\n- Twitter: [https://twitter.com/BlockEdenHQ](https://twitter.com/BlockEdenHQ)\n- Discord: [https://discord.gg/4Yfvs2HWey](https://discord.gg/4Yfvs2HWey)\n- Source Link: https://blockeden.xyz/blog/2024/07/08/ton/"
  },
  {
    "id": "/2024/06/20/decentralized-inference-blockeden-xyz",
    "metadata": {
      "permalink": "/blog/2024/06/20/decentralized-inference-blockeden-xyz",
      "source": "@site/blog/2024-06-20-decentralized-inference-blockeden-xyz.md",
      "title": "Decentralized AI: Permissionless LLM Inference on BlockEden.xyz",
      "description": "Discover how BlockEden.xyz revolutionizes AI inference with its decentralized, permissionless infrastructure. Learn about the benefits for AI researchers, hardware operators, and developers in this comprehensive overview of BlockEden.xyz's collaboration with Cuckoo Network on the unique approach to decentralized AI services.",
      "date": "2024-06-20T00:00:00.000Z",
      "formattedDate": "June 20, 2024",
      "tags": [
        {
          "label": "ai",
          "permalink": "/blog/tags/ai"
        },
        {
          "label": "cuckoo chain",
          "permalink": "/blog/tags/cuckoo-chain"
        }
      ],
      "readingTime": 4.18,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Decentralized AI: Permissionless LLM Inference on BlockEden.xyz",
        "authors": [
          "dora"
        ],
        "tags": [
          "ai",
          "cuckoo chain"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/decentralized-inference-blockeden-xyz.webp",
        "description": "Discover how BlockEden.xyz revolutionizes AI inference with its decentralized, permissionless infrastructure. Learn about the benefits for AI researchers, hardware operators, and developers in this comprehensive overview of BlockEden.xyz's collaboration with Cuckoo Network on the unique approach to decentralized AI services."
      },
      "unlisted": false,
      "prevItem": {
        "title": "Understanding TON: Revolutionizing Blockchain and Formidable Ecosystem",
        "permalink": "/blog/2024/07/08/ton"
      },
      "nextItem": {
        "title": "Join the Sui Overflow Hackathon and Win $5000 in Sui with BlockEden.xyz!",
        "permalink": "/blog/2024/05/13/join-the-sui-overflow-hackathon-and-win-5000-in-sui-with-blockedenxyz"
      }
    },
    "content": "BlockEden.xyz, known for its Remote Procedure Call (RPC) infrastructure, is expanding into AI inference services. This evolution leverages its open-source, permissionless design to create a marketplace where model researchers, hardware operators, API providers, and users interact seamlessly. The network's Relay Mining algorithm ensures a transparent and verifiable service, presenting a unique opportunity for large model AI researchers to monetize their work without infrastructure maintenance.\n\n## The Core Problem\n\nThe AI landscape faces significant challenges, including:\n\n- **Restricted Model-Serving Environments**: Resource-intensive infrastructure limits AI researchers' ability to experiment with various models.\n- **Unsustainable Business Models for Open Source Innovation**: Independent engineers struggle to monetize their work, relying on major infrastructure providers.\n- **Unequal Market Access**: Enterprise-grade models dominate, leaving mid-tier models and users underserved.\n\n## BlockEden.xyz’s Unique Value Proposition\n\nBlockEden.xyz addresses these issues by decoupling the infrastructure layer from the product and services layer, ensuring an open and decentralized framework. This setup enables high-quality service delivery and aligns incentives among all network participants.\n\nKey benefits include:\n\n- **Established Network**: Utilizing an existing network of BlockEden.xyz's services to streamline model access and service quality.\n- **Separation of Concerns**: Each stakeholder focuses on their strengths, improving overall ecosystem efficiency.\n- **Incentive Alignment**: Cryptographic proofs and performance measurements drive competition and transparency.\n- **Permissionless Models & Supply**: An open marketplace for cost-effective hardware supply.\n\n## Decentralized AI Inference Stakeholders\n\n**Model Providers: Coordinators**\n\nCoordinators manage the product and services layer, optimizing service quality and providing seamless access for applications. Coordinators discreetly ensure supplier integrity by posing as regular users, offering unbiased performance assessments.\n\n**Model Users: Applications**\n\nApplications typically use first-party coordinators but can also access the network with a third-party for enhanced privacy and cost savings. Direct access allows for diverse use case experimentation and eliminates intermediary costs.\n\n**Model Suppliers: Hardware Operators**\n\nSuppliers run inference nodes to earn tokens. Their competencies in DevOps, hardware maintenance, and logging are crucial for network growth. The permissionless approach encourages participation from various hardware providers, including those with idle or dormant resources.\n\n**Model Sources: Engineers & Researchers**\n\nResearchers and institutions that open-source models can earn revenue based on usage. This model incentivizes innovation without the need for infrastructure maintenance, providing a sustainable business model for open-source contributors.\n\n## Working with Cuckoo Network\n\nBlockEden.xyz collaborates with Cuckoo Network to revolutionize AI inference through a decentralized and permissionless infrastructure. This partnership focuses on leveraging both platforms' strengths to create a seamless and efficient ecosystem for AI model deployment and monetization.\n\n#### Key Collaboration Areas\n\n- **Infrastructure Integration**: Combining BlockEden.xyz's robust RPC infrastructure with Cuckoo Network's decentralized model-serving capabilities to offer a scalable and resilient AI inference service.\n- **Model Distribution**: Facilitating the distribution of open-source AI models across the network, enabling researchers to reach a broader audience and monetize their innovations without the need for extensive infrastructure.\n- **Quality Assurance**: Implementing mechanisms for continuous monitoring and assessment of model performance and supplier integrity, ensuring high-quality service delivery and reliability.\n- **Economic Incentives**: Aligning economic incentives across all stakeholders through cryptographic proofs and [performance-based rewards](https://scan.cuckoo.network/token/0xdf0Fba4d78173C86a9D71B3Fbf79Bf2dbaE4b931), fostering a competitive and transparent marketplace.\n- **Privacy and Security**: Enhancing privacy-preserving operations and secure model inference through advanced technologies like Trusted Execution Environments (TEE) and decentralized data storage solutions.\n- **Community and Support**: Building a supportive community for AI researchers and developers, providing resources, guidance, and incentives to drive innovation and adoption within the decentralized AI ecosystem.\n\nBy partnering with Cuckoo Network, BlockEden.xyz aims to create a holistic and decentralized approach to AI inference, empowering researchers, developers, and users with a robust, transparent, and efficient platform for AI model deployment and utilization. You can now try decentralized text-to-image API at https://blockeden.xyz/api-marketplace/cuckoo-ai.\n\n## Input/Output of a Decentralized Inference Network\n\n**LLM Inputs to Cuckoo Network**:\n\n- Open-source models\n- Demand from end-users or Applications\n- Aggregated supply from commodity hardware\n- Quality of service guarantees\n\n**LLM Outputs from Cuckoo Network**:\n\n- No downtime\n- Seamless model experimentation\n- Public model evaluation\n- Privacy-preserving operations\n- Censorship-free models\n\n## Web3 Ecosystem Integrations\n\nBlockEden.xyz's RPC protocol can integrate with other Web3 protocols to enhance Decentralized AI (DecAI):\n\n**Data & Storage Networks**: Seamless integration with decentralized storage solutions like Filecoin/IPFS and Arweave for model storage and data integrity.\n\n**Compute Networks**: Complementary services leveraging decentralized computing layers like Akash and Render, supporting both dedicated and idle hardware.\n\n**Inference Networks**: Flexible deployment models and robust ecosystems supporting diverse inference tasks.\n\n**Applications**: AI agents, consumer apps, and IoT devices benefit from DecAI inference for personalized services, data privacy, and edge decision-making.\n\n## Summary\n\nBlockEden.xyz's established infrastructure and economic design unlock new opportunities for open-source AI. By providing a decentralized and verifiable service, it bridges the gap between open-source AI and Web3, enabling innovative, sustainable, and reliable services. This approach allows for greater model diversity, better market access for SMEs, and a new business model for open-source researchers. Future developments will continue to expand the ecosystem, ensuring BlockEden.xyz remains a robust and adaptable solution in the evolving AI and blockchain landscapes.\n\n- Twitter:[ https://twitter.com/BlockEdenHQ](https://twitter.com/BlockEdenHQ)\n- Discord:[ https://discord.gg/4Yfvs2HWey](https://discord.gg/4Yfvs2HWey)\n- Source Link: https://blockeden.xyz/blog/2024/06/20/decentralized-inference-blockeden-xyz/"
  }
]