[
  {
    "id": "/2024/02/11/spin-out-payton",
    "metadata": {
      "permalink": "/blog/2024/02/11/spin-out-payton",
      "source": "@site/blog/2024-02-11-spin-out-payton.md",
      "title": "BlockEden.xyz spins out Payton to accept crypto payment",
      "description": "BlockEden.xyz is on a mission to propel the mass adoption of Web3 for all Internet users. In our continuous efforts to integrate cryptocurrencies into everyday life, we are excited to announce the spinout of Payton.so, a cutting-edge payment solution.",
      "date": "2024-02-11T00:00:00.000Z",
      "formattedDate": "February 11, 2024",
      "tags": [
        {
          "label": "company",
          "permalink": "/blog/tags/company"
        },
        {
          "label": "product",
          "permalink": "/blog/tags/product"
        }
      ],
      "readingTime": 2.185,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "BlockEden.xyz spins out Payton to accept crypto payment",
        "authors": [
          "dora"
        ],
        "tags": [
          "company",
          "product"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/payton-tile.png"
      },
      "unlisted": false,
      "nextItem": {
        "title": "BlockEden.xyz plans to join Espresso shared sequencer network",
        "permalink": "/blog/2024/02/05/blockeden-xyz-espresso-sequencer"
      }
    },
    "content": "BlockEden.xyz is on a mission to propel the mass adoption of Web3 for all Internet users. In our continuous efforts to integrate cryptocurrencies into everyday life, we are excited to announce the spinout of Payton.so, a cutting-edge payment solution.\n\n## Pioneering the Integration of Crypto in Everyday Transactions\n\nAs advocates for the widespread adoption of blockchain technology, we firmly believe that for crypto to become an integral part of people's lives, it needs to seamlessly integrate into payment, retail, and e-commerce. Payton.so is our response to this vision, providing a user-friendly platform to facilitate crypto transactions in daily transactions.\n\n![Payton](https://tp-misc.b-cdn.net/blockeden/payton-blog-hero.webp)\n\n## How to get started?\n\n![How to Pay BlockEden.xyz with APT, USDC, USDT on Aptos](https://tp-misc.b-cdn.net/blockeden/how-to-pay-blockeden-xyz-with-apt.png \"How to Pay BlockEden.xyz with APT, USDC, USDT on Aptos\")\n\n**Step 1: Get Your APT Wallet Ready**\n\nBefore you can pay for your subscription with APT, you will need an APT wallet. You can get any wallet that supports Aptos, like [Pontem](https://pontem.network/). Once you have a wallet, make sure it has enough funds to cover the subscription cost. You can transfer money from other wallets or buy more tokens directly from exchanges like Coinbase, [Hippo.space](https://hippo.space/) or [LiquidSwap](https://liquidswap.com/#/).\n\n**Step 2: Go to Our Website and Select the Subscription Plan**\n\nOnce your wallet is ready, go to BlockEden. xyz's website https://blockeden.xyz/pricing/ and select the best plan for your needs. Then, click *Pay with crypto* and select *APT* over the *Aptos* network as your payment method. This will generate an address with a QR code containing the recipient's address. Please send the **exact amount of coins** to the listed address. Once this is done, you will see *Payment succeeded* and click the button to get back to the dashboard.\n\n**Step 3: Confirm Your Payment**\n\nWhen you have completed the transaction, recheck your wallet balance and ensure that the correct amount has been deducted. If everything looks good, then congratulations! You have successfully paid for your subscription using APT tokens! Now all that's left is to start using our services and enjoy all of their benefits!\n\n## Join the Revolution\n\nWe invite ambitious Web3 organizations, freelancers, and crypto enthusiasts to join us on this exciting journey. Payton.so is more than just a payment solution; it's a catalyst for the widespread adoption of cryptocurrencies in everyday financial transactions.\n\nStay tuned for upcoming features, partnerships, and developments as we work towards making Payton.so the go-to platform for crypto payments in the Web3 era. Together, let's build a decentralized financial future that empowers individuals and organizations worldwide.\n\nStay connected with BlockEden.xyz and Payton.so on our [official website](https://blockeden.xyz/) and follow us on [social media](https://twitter.com/BlockEdenHQ) for the latest updates and insights."
  },
  {
    "id": "/2024/02/05/blockeden-xyz-espresso-sequencer",
    "metadata": {
      "permalink": "/blog/2024/02/05/blockeden-xyz-espresso-sequencer",
      "source": "@site/blog/2024-02-05-blockeden-xyz-espresso-sequencer.md",
      "title": "BlockEden.xyz plans to join Espresso shared sequencer network",
      "description": "Ethereum L2 rollups are centralized. Espresso is trying to decentralize it, and BlockEden.xyz shares the excitement about this vision.",
      "date": "2024-02-05T00:00:00.000Z",
      "formattedDate": "February 5, 2024",
      "tags": [
        {
          "label": "product",
          "permalink": "/blog/tags/product"
        }
      ],
      "readingTime": 1.83,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "BlockEden.xyz plans to join Espresso shared sequencer network",
        "authors": [
          "dora"
        ],
        "tags": [
          "product"
        ],
        "description": "Ethereum L2 rollups are centralized. Espresso is trying to decentralize it, and BlockEden.xyz shares the excitement about this vision.",
        "image": "https://tp-misc.b-cdn.net/blockeden/64aeab361b9e2f29031dfabf_bronzemachine-inside-bw.png"
      },
      "unlisted": false,
      "prevItem": {
        "title": "BlockEden.xyz spins out Payton to accept crypto payment",
        "permalink": "/blog/2024/02/11/spin-out-payton"
      },
      "nextItem": {
        "title": "BlockEden.xyz High-Availability Delegated Blockchain Node Infrastructure",
        "permalink": "/blog/2024/01/10/delegated-staking-infra"
      }
    },
    "content": "## **Why Espresso sequencer?**\n\nEthereum L2 rollups are centralized. Take [Optimism Architecture](https://blockeden.xyz/blog/2023/04/15/optimism-architecture/) for example. The globally-single sequencer receives L2 transactions from L2 users, creates L2 blocks accordingly, and then submits to [data availability provider](https://tianpan.co/optimism-bedrock-specs/glossary.html#data-availability-provider) (via a [batcher](https://tianpan.co/optimism-bedrock-specs/glossary.html#batcher)). It also submits [output roots](https://tianpan.co/optimism-bedrock-specs/glossary.html#l2-output-root) to L1.\n\nEspresso is trying to decentralize such sequencer and then achieve credible neutrality, enhance interoperability, mitigate the negative effects of MEV, and encourage long-term economic incentive alignment with L1 validators.\n\n## **How does it work with rollups?**\n\nBefore the shared sequencer:\n\n![](https://i.imgur.com/ls8rBQq.png)\n\nAfter introducing the shared sequencer:\n\n![](https://i.imgur.com/2Fcii43.png)\n\n\n## **What is our motivation to join the Espresso Sequencer as an operator?**\n\n1. Shared vision for solving the composability problem between rollups on Ethereum.\n2. A passion for Yale alums's project.\n3. Our partnership with token holders willing to stake with us and Espresso Sequencer.\n4. Our business model ($45M staked and 21 chains' APIs supported) is built on the decentralization of L1s and L2s.\n5. Our expertise with high availability infrastructure fits into the need.\n6. We contribute to the ecosystem. e.g., Sui indexer, Aptos indexer, explorer, docs, community events, etc.\n\n## **What differentiates us from our competitors?**\n\n1. We use Ssilicon VValley standard techniques to run and monitor our infrastructure.\n2. We started with Aptos with a 99.99% uptime and expanded to include Sui, Solana, and 12 EVM blockchains. Now, there are $45M staked and 21 chains' APIs supported.\n3. We host community events with 10x.pub and offer educational sessions around blockchain system design.\n4. We make ecosystem contributions and build SaaS or mobile apps to improve the user experience.\n\n## **What slashing protection(s) do we offer?**\n\n1. Uptime monitoring transparently with 7/24 hours of on-call rotation among our team.\n2. Use on-call playbook and failover techniques to handle failures.\n3. Use hot standby if necessary.\n4. Committed to staying engaged with the community and upgrading service timely.\n\n## **How do we secure our infrastructure?**\n\nWe proactively use AWS key management service, HTTPs, MFA with YubiKey for cloud accounts, Cloudflare for DDoS, rate limiter, authorization and access control, zero trust architecture, security by design when building our infra, etc. Our team comprises IoTeX founding members and security engineers from Uber and Google."
  },
  {
    "id": "/2024/01/10/delegated-staking-infra",
    "metadata": {
      "permalink": "/blog/2024/01/10/delegated-staking-infra",
      "source": "@site/blog/2024-01-10-delegated-staking-infra.md",
      "title": "BlockEden.xyz High-Availability Delegated Blockchain Node Infrastructure",
      "description": "Learn about the features and benefits, including simplified node setup, reduced costs, and stable network performance.",
      "date": "2024-01-10T00:00:00.000Z",
      "formattedDate": "January 10, 2024",
      "tags": [
        {
          "label": "company",
          "permalink": "/blog/tags/company"
        }
      ],
      "readingTime": 4.005,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "BlockEden.xyz High-Availability Delegated Blockchain Node Infrastructure",
        "authors": [
          "dora"
        ],
        "tags": [
          "company"
        ],
        "description": "Learn about the features and benefits, including simplified node setup, reduced costs, and stable network performance.",
        "image": "https://beancount-io.b-cdn.net/upgrade-server.jpg"
      },
      "unlisted": false,
      "prevItem": {
        "title": "BlockEden.xyz plans to join Espresso shared sequencer network",
        "permalink": "/blog/2024/02/05/blockeden-xyz-espresso-sequencer"
      },
      "nextItem": {
        "title": "[Pitch Deck] Stellar Soroban Indexer and GraphQL",
        "permalink": "/blog/2023/10/07/soroban-indexer-pitch-deck"
      }
    },
    "content": "**Node operation made easy with a reliable infrastructure**\n\nBlockEden.xyz introduces an advanced blockchain node infrastructure, enhancing the reliability and performance of blockchain operations. This development empowers customers to manage blockchain nodes easily and efficiently, ensuring the high availability and robustness of their blockchain applications.\n\nBlockchain node operation often encounters issues like network instability, uptime monitoring, complex setup processes, and high maintenance costs. These challenges pose significant hurdles for businesses and individuals seeking to leverage blockchain technology.\n\nBlockEden.xyz's delegated staking infrastructure offers a state-of-the-art solution to these challenges. This high-availability blockchain node infrastructure simplifies node setup, reduces operational costs, and ensures stable and consistent network performance. This makes blockchain technology more accessible and practical for a broader range of users.\n\n![](https://tp-misc.b-cdn.net/blockeden/soroban-indexer-blockeden-xyz-pitch-deck1.png)\n\nBlockEden.xyz has an impressive track record, starting with Aptos and maintaining 99.9% uptime since its mainnet launch. Our services have expanded to include Sui, Solana, and 12 EVM blockchains, demonstrating our adaptability and commitment to staying at the forefront of the industry. With over $45 million worth of tokens staked with us, our clients trust us to provide reliable and secure solutions for their web3 and blockchain needs.\n\n### What is BlockEden.xyz’s Offering of the Delegated Staking Infra?\n\n1. Integrating with new networks.\n2. Managed/delegated services to run blockchain nodes, including maintaining a service-level agreement, status monitoring, active on-call, and failover.\n3. Develop tools to improve efficiency, e.g., distributing rewards.\n\nInternal FAQs\n\n### What are the OKRs for Delegated Staking Infra Trying to Achieve?\n\nGoals:\n* Build a reliable, safe, extensible, and cost-efficient delegated staking infrastructure to sustainably generate revenue streams for BlockEden.xyz.\n  * Reliable: the delegate node should have high availability.\n  * Safe: the funds delegated to us should be safe.\n  * Extensible: the infra should be reusable to expand to another blockchain network.\n  * Cost-efficient: the infra machine cost should be covered by the delegate revenue.\n\n| Items                       | Key Results                |\n| --------------------------- | -------------------------- |\n| SLO server uptime           | 99.9%                      |\n| New network onboarding time | \\<= 2 weeks for EVM chains |\n\n### Why is Delegated Staking Infra Important to BlockEden.xyz?\n\n* It’s the revenue-generating program, bringing resources to do more strategic infra work.\n* It’s an essential infra component to serve chain RPCs, particularly for latency-sensitive use cases.\n\n### How Can Delegated Staking Infra Fail? Would it Cause Customer Dislikes?\n\n* Failures in delegated staking infrastructure primarily occur due to service disruptions and server downtime. These issues can prevent customers from staking tokens or lead to reduced rewards due to slashing penalties. Such disruptions often result in customer dissatisfaction due to unmet expectations of consistent earnings and reliable service.\n\n### What are the Dependencies?\n\n* Network Selection: The chosen blockchain network plays a critical role. Different networks may have varying protocols, reward structures, and security requirements.\n* Initial Funding: To participate as a validator in the staking process, an initial investment or fund is required. This amount varies depending on the network's criteria and serves as your stake in the network.\n\n### What are the Risks?\n\n* Fund Safety: Ideally, we should make a product that doesn’t bear the liability for the customer's fund. However, it largely depends on the blockchain's features, e.g., isolation of token owner and node operator permission.\n* Crypto Market Volatility: In a sudden crypto price crash or bearish market, the token rewards might be short to cover the machine cost. A liquidation plan should be in place to ensure funds are secured to operate the infra.\n\n### How to Use this Staking Infra?\n\n* BlockEden.xyz offers comprehensive documentation for getting started with our staking infrastructure, including step-by-step guides for both manual staking processes\n\n### **Why does staking infra matter to me?**\n\n- **Ease of Access**: You can easily participate in staking and enjoy its benefits without needing deep technical knowledge or extensive resources.\n- **Flexibility for Future Growth**: We provide the capability for future technical integrations with your needs, ensuring that as your staking needs evolve, our infrastructure can accommodate them.\n\n### **How to use this staking infra?**\n\n- To get started with our staking infrastructure, BlockEden.xyz offers comprehensive documentation. This includes step-by-step guides for both manual staking processes and technical integrations.\n- We're committed to supporting your journey, addressing concerns and fulfilling requirements as they arise, ensuring a smooth and effective staking experience.\n\n### **How do I know if this staking infra is the right solution to my problem?**\n\n- To assess if our staking infrastructure suits your requirements, we recommend a phased approach. Start by trialing our service with selected networks. Monitor performance and stability over a set period. Based on this experience and the proven results obtained, you can then evaluate the effectiveness of our solution. This data-driven approach allows for informed decision-making and helps forecast potential future revenues, ensuring alignment with your business objectives."
  }
]