[
  {
    "id": "/2024/02/19/blockeden-xyz-join-stellar-to-bring-data-of-its-new-smart-contract-platform-soroban-to-developers",
    "metadata": {
      "permalink": "/blog/2024/02/19/blockeden-xyz-join-stellar-to-bring-data-of-its-new-smart-contract-platform-soroban-to-developers",
      "source": "@site/blog/2024-02-19-blockeden-xyz-join-stellar-to-bring-data-of-its-new-smart-contract-platform-soroban-to-developers.md",
      "title": "BlockEden.xyz joins Stellar to bring the API of its new smart contract platform Soroban to developers",
      "description": "We are excited to share that BlockEden.xyz is joining hands with Stellar, in order to empower developers worldwide.",
      "date": "2024-02-19T00:00:00.000Z",
      "formattedDate": "February 19, 2024",
      "tags": [
        {
          "label": "company",
          "permalink": "/blog/tags/company"
        },
        {
          "label": "product",
          "permalink": "/blog/tags/product"
        },
        {
          "label": "stellar",
          "permalink": "/blog/tags/stellar"
        }
      ],
      "readingTime": 3.225,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "BlockEden.xyz joins Stellar to bring the API of its new smart contract platform Soroban to developers",
        "authors": [
          "dora"
        ],
        "tags": [
          "company",
          "product",
          "stellar"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/soroban-data-analytics.png",
        "description": "We are excited to share that BlockEden.xyz is joining hands with Stellar, in order to empower developers worldwide."
      },
      "unlisted": false,
      "nextItem": {
        "title": "BlockEden.xyz spins out Payton to accept crypto payment",
        "permalink": "/blog/2024/02/11/spin-out-payton"
      }
    },
    "content": "We are excited to share that BlockEden.xyz is joining hands with Stellar, in order to empower developers worldwide. Stellar's blockchain platform has been a game-changer in quick and affordable cross-border transactions, while BlockEden.xyz's reliable API offerings for diverse DApps have positioned us as a key player across multiple blockchains. Together, we are poised to inspire a dynamic shift in the realms of blockchain and global finance.\n\n![](https://tp-misc.b-cdn.net/blockeden/soroban-data-analytics.png)\n\n\n## **What is Stellar**\n\nStellar is an open-source, decentralized blockchain network designed to facilitate swift, low-cost cross-border transactions. Introduced in 2014 by Jed McCaleb, co-founder of Ripple and eDonkey, the Stellar network operates on a unique consensus protocol rather than the traditional proof-of-work or proof-of-stake mechanisms. People use Stellar network to build applications, issue assets, and build anchors (currency converters).\n\n### Stellar Soroban\n\nSoroban is a smart contract platform that is integrated into the existing Stellar blockchain. Developers could develop smart contracts with a Rust dialect and interact with Stellar’s accounts and assets, not other operations like SDEX, AMMs, Claimable Balances, or Sponsorships.\n\nThe Soroban mainnet upgrade is scheduled for February 20th .\n\n## **What is BlockEden.xyz**\n\nBlockEden.xyz is an API marketplace powering DApps of all sizes for Sui, Aptos, Solana, and 12 EVM blockchains. Why do our customers choose us?\n\n1. High availability. We maintain 99.9% uptime since our first API - Aptos main net launch.\n2. Inclusive API offerings and community. Our services have expanded to include Sui, Ethereum, IoTeX, Solana, Polygon, Polygon zkEVM, Filecoin, Harmony, BSC, Arbitrum, Optimism, Gnosis, Arbitrum Nova & EthStorage Galileo. Our community 10x.pub has 4000+ web3 innovators from Silicon Valley, Seattle, and NYC.\n3. Security. With over $45 million worth of tokens staked with us, our clients trust us to provide reliable and secure solutions for their web3 and blockchain needs.\n\nWe provide a comprehensive suite of services designed to empower every participant in the blockchain space, focusing on three key areas:\n\n- For blockchain **protocol builders**, we ensure robust security and decentralization by operating nodes and making long-term ecosystem contributions.\n- For **DApp developers**, we build user-friendly APIs to streamline development and unleash the full potential of decentralized applications.\n- For **token holders**, we offer a reliable staking service to maximize rewards and optimize asset management.\n\n## **What is** **BlockEden.xyz building on Stellar and what** **does this mean for developers?**\n\nBlockEden.xyz is leveraging the Stellar network to offer commercial Soroban RPC and indexed data to help DApp developers to speed up development with a GraphQL API and analytics.\n\nThis comprehensive expansion into Stellar's infrastructure is set to present developers with more resources and tools, potentially facilitating easier adoption and more robust application development within the Stellar blockchain ecosystem.\n\n**Node operator and Indexer for Soroban RPC and Indexer GraphQL**\n\nAs a node operator, BlockEden.xyz runs Soroban RPC, and then provides commercial standard RPCs to developers on the left. Unlike the official endpoints, our RPCs are equipped with rate limits and API meters tailored to developers’ tiered needs.\n\nBlockEden.xyz also builds an indexer for contract data, tokens, events, etc. in the Soroban smart contract platform.\n\n![img](https://tp-misc.b-cdn.net/blockeden/soroban-how-indexer-works.png)\n\nThe index data will serve as [GraphQL](https://blockeden.xyz/api-marketplace/stellar-soroban-indexer). The exact content of the index data is to be decided, though we will expose at least the developer-facing data models of the Horizon service.\n\n![img](https://tp-misc.b-cdn.net/blockeden/soroban-indexer-01_99.webp)\n\n**Business Intelligence / Analytics**\n\n![img](https://tp-misc.b-cdn.net/blockeden/soroban-mainnet-analytics.webp)\n\n\n**Soroban RPC**\n\nFor developer's convenience, we also serve [the standard JSON RPC](https://blockeden.xyz/api-marketplace/stellar-soroban).\n\n## **Conclusion**\n\nIn conclusion, as we pave the way towards a new era in blockchain and global finance, our partnership with Stellar represents a significant milestone. Harnessing Stellar's swift, cost-effective transaction capabilities and BlockEden.xyz's high-quality API offerings, we are poised to create a paradigm shift in the way developers engage with the open money network. We hope this work will inspire innovations, trigger advancements, and propel us all towards a more connected and decentralized world. Here's to a future filled with endless possibilities and shared successes."
  },
  {
    "id": "/2024/02/11/spin-out-payton",
    "metadata": {
      "permalink": "/blog/2024/02/11/spin-out-payton",
      "source": "@site/blog/2024-02-11-spin-out-payton.md",
      "title": "BlockEden.xyz spins out Payton to accept crypto payment",
      "description": "BlockEden.xyz is on a mission to propel the mass adoption of Web3 for all Internet users. In our continuous efforts to integrate cryptocurrencies into everyday life, we are excited to announce the spinout of Payton.so, a cutting-edge payment solution.",
      "date": "2024-02-11T00:00:00.000Z",
      "formattedDate": "February 11, 2024",
      "tags": [
        {
          "label": "company",
          "permalink": "/blog/tags/company"
        },
        {
          "label": "product",
          "permalink": "/blog/tags/product"
        }
      ],
      "readingTime": 2.185,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "BlockEden.xyz spins out Payton to accept crypto payment",
        "authors": [
          "dora"
        ],
        "tags": [
          "company",
          "product"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/payton-tile.png"
      },
      "unlisted": false,
      "prevItem": {
        "title": "BlockEden.xyz joins Stellar to bring the API of its new smart contract platform Soroban to developers",
        "permalink": "/blog/2024/02/19/blockeden-xyz-join-stellar-to-bring-data-of-its-new-smart-contract-platform-soroban-to-developers"
      },
      "nextItem": {
        "title": "BlockEden.xyz plans to join Espresso shared sequencer network",
        "permalink": "/blog/2024/02/05/blockeden-xyz-espresso-sequencer"
      }
    },
    "content": "BlockEden.xyz is on a mission to propel the mass adoption of Web3 for all Internet users. In our continuous efforts to integrate cryptocurrencies into everyday life, we are excited to announce the spinout of Payton.so, a cutting-edge payment solution.\n\n## Pioneering the Integration of Crypto in Everyday Transactions\n\nAs advocates for the widespread adoption of blockchain technology, we firmly believe that for crypto to become an integral part of people's lives, it needs to seamlessly integrate into payment, retail, and e-commerce. Payton.so is our response to this vision, providing a user-friendly platform to facilitate crypto transactions in daily transactions.\n\n![Payton](https://tp-misc.b-cdn.net/blockeden/payton-blog-hero.webp)\n\n## How to get started?\n\n![How to Pay BlockEden.xyz with APT, USDC, USDT on Aptos](https://tp-misc.b-cdn.net/blockeden/how-to-pay-blockeden-xyz-with-apt.png \"How to Pay BlockEden.xyz with APT, USDC, USDT on Aptos\")\n\n**Step 1: Get Your APT Wallet Ready**\n\nBefore you can pay for your subscription with APT, you will need an APT wallet. You can get any wallet that supports Aptos, like [Pontem](https://pontem.network/). Once you have a wallet, make sure it has enough funds to cover the subscription cost. You can transfer money from other wallets or buy more tokens directly from exchanges like Coinbase, [Hippo.space](https://hippo.space/) or [LiquidSwap](https://liquidswap.com/#/).\n\n**Step 2: Go to Our Website and Select the Subscription Plan**\n\nOnce your wallet is ready, go to BlockEden. xyz's website https://blockeden.xyz/pricing/ and select the best plan for your needs. Then, click *Pay with crypto* and select *APT* over the *Aptos* network as your payment method. This will generate an address with a QR code containing the recipient's address. Please send the **exact amount of coins** to the listed address. Once this is done, you will see *Payment succeeded* and click the button to get back to the dashboard.\n\n**Step 3: Confirm Your Payment**\n\nWhen you have completed the transaction, recheck your wallet balance and ensure that the correct amount has been deducted. If everything looks good, then congratulations! You have successfully paid for your subscription using APT tokens! Now all that's left is to start using our services and enjoy all of their benefits!\n\n## Join the Revolution\n\nWe invite ambitious Web3 organizations, freelancers, and crypto enthusiasts to join us on this exciting journey. Payton.so is more than just a payment solution; it's a catalyst for the widespread adoption of cryptocurrencies in everyday financial transactions.\n\nStay tuned for upcoming features, partnerships, and developments as we work towards making Payton.so the go-to platform for crypto payments in the Web3 era. Together, let's build a decentralized financial future that empowers individuals and organizations worldwide.\n\nStay connected with BlockEden.xyz and Payton.so on our [official website](https://blockeden.xyz/) and follow us on [social media](https://twitter.com/BlockEdenHQ) for the latest updates and insights."
  },
  {
    "id": "/2024/02/05/blockeden-xyz-espresso-sequencer",
    "metadata": {
      "permalink": "/blog/2024/02/05/blockeden-xyz-espresso-sequencer",
      "source": "@site/blog/2024-02-05-blockeden-xyz-espresso-sequencer.md",
      "title": "BlockEden.xyz plans to join Espresso shared sequencer network",
      "description": "Ethereum L2 rollups are centralized. Espresso is trying to decentralize it, and BlockEden.xyz shares the excitement about this vision.",
      "date": "2024-02-05T00:00:00.000Z",
      "formattedDate": "February 5, 2024",
      "tags": [
        {
          "label": "product",
          "permalink": "/blog/tags/product"
        }
      ],
      "readingTime": 1.83,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "BlockEden.xyz plans to join Espresso shared sequencer network",
        "authors": [
          "dora"
        ],
        "tags": [
          "product"
        ],
        "description": "Ethereum L2 rollups are centralized. Espresso is trying to decentralize it, and BlockEden.xyz shares the excitement about this vision.",
        "image": "https://tp-misc.b-cdn.net/blockeden/64aeab361b9e2f29031dfabf_bronzemachine-inside-bw.png"
      },
      "unlisted": false,
      "prevItem": {
        "title": "BlockEden.xyz spins out Payton to accept crypto payment",
        "permalink": "/blog/2024/02/11/spin-out-payton"
      },
      "nextItem": {
        "title": "BlockEden.xyz High-Availability Delegated Blockchain Node Infrastructure",
        "permalink": "/blog/2024/01/10/delegated-staking-infra"
      }
    },
    "content": "## **Why Espresso sequencer?**\n\nEthereum L2 rollups are centralized. Take [Optimism Architecture](https://blockeden.xyz/blog/2023/04/15/optimism-architecture/) for example. The globally-single sequencer receives L2 transactions from L2 users, creates L2 blocks accordingly, and then submits to [data availability provider](https://tianpan.co/optimism-bedrock-specs/glossary.html#data-availability-provider) (via a [batcher](https://tianpan.co/optimism-bedrock-specs/glossary.html#batcher)). It also submits [output roots](https://tianpan.co/optimism-bedrock-specs/glossary.html#l2-output-root) to L1.\n\nEspresso is trying to decentralize such sequencer and then achieve credible neutrality, enhance interoperability, mitigate the negative effects of MEV, and encourage long-term economic incentive alignment with L1 validators.\n\n## **How does it work with rollups?**\n\nBefore the shared sequencer:\n\n![](https://i.imgur.com/ls8rBQq.png)\n\nAfter introducing the shared sequencer:\n\n![](https://i.imgur.com/2Fcii43.png)\n\n\n## **What is our motivation to join the Espresso Sequencer as an operator?**\n\n1. Shared vision for solving the composability problem between rollups on Ethereum.\n2. A passion for Yale alums's project.\n3. Our partnership with token holders willing to stake with us and Espresso Sequencer.\n4. Our business model ($45M staked and 21 chains' APIs supported) is built on the decentralization of L1s and L2s.\n5. Our expertise with high availability infrastructure fits into the need.\n6. We contribute to the ecosystem. e.g., Sui indexer, Aptos indexer, explorer, docs, community events, etc.\n\n## **What differentiates us from our competitors?**\n\n1. We use Ssilicon VValley standard techniques to run and monitor our infrastructure.\n2. We started with Aptos with a 99.99% uptime and expanded to include Sui, Solana, and 12 EVM blockchains. Now, there are $45M staked and 21 chains' APIs supported.\n3. We host community events with 10x.pub and offer educational sessions around blockchain system design.\n4. We make ecosystem contributions and build SaaS or mobile apps to improve the user experience.\n\n## **What slashing protection(s) do we offer?**\n\n1. Uptime monitoring transparently with 7/24 hours of on-call rotation among our team.\n2. Use on-call playbook and failover techniques to handle failures.\n3. Use hot standby if necessary.\n4. Committed to staying engaged with the community and upgrading service timely.\n\n## **How do we secure our infrastructure?**\n\nWe proactively use AWS key management service, HTTPs, MFA with YubiKey for cloud accounts, Cloudflare for DDoS, rate limiter, authorization and access control, zero trust architecture, security by design when building our infra, etc. Our team comprises IoTeX founding members and security engineers from Uber and Google."
  }
]