[
  {
    "id": "/2024/07/22/venture-capital-blockchain-investment-ceo-insight",
    "metadata": {
      "permalink": "/blog/2024/07/22/venture-capital-blockchain-investment-ceo-insight",
      "source": "@site/blog/2024-07-22-venture-capital-blockchain-investment-ceo-insight.md",
      "title": "Realities of Venture Capital and Blockchain Investment",
      "description": "Venture Capital (VC) in the blockchain industry often gets shrouded in sophisticated analysis and technical jargon. At its core, however, the principle is simple: sell tokens. Many VCs, particularly those new to the field, struggle to generate profits due to a lack of deep industry knowledge. They often fail to grasp fundamental concepts like gas fees. Their primary role becomes promoting and supporting their investments through various channels, including public endorsements and content creation.",
      "date": "2024-07-22T00:00:00.000Z",
      "formattedDate": "July 22, 2024",
      "tags": [
        {
          "label": "Investment Research",
          "permalink": "/blog/tags/investment-research"
        }
      ],
      "readingTime": 2.245,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Realities of Venture Capital and Blockchain Investment",
        "authors": [
          "dora"
        ],
        "tags": [
          "Investment Research"
        ],
        "image": "https://cuckoo-network.b-cdn.net/2024-07-22-venture-capital-blockchain-investment-ceo-insight.webp",
        "description": "Venture Capital (VC) in the blockchain industry often gets shrouded in sophisticated analysis and technical jargon. At its core, however, the principle is simple: sell tokens. Many VCs, particularly those new to the field, struggle to generate profits due to a lack of deep industry knowledge. They often fail to grasp fundamental concepts like gas fees. Their primary role becomes promoting and supporting their investments through various channels, including public endorsements and content creation."
      },
      "unlisted": false,
      "nextItem": {
        "title": "IoTeX 2.0: Empowering DePIN for Everyone",
        "permalink": "/blog/2024/07/18/iotex-2-0-depin-for-everyone"
      }
    },
    "content": "In the rapidly evolving world of blockchain, venture capital plays a crucial role. Yet, beneath the surface of sophisticated analysis lies a straightforward goal: selling tokens. Unfortunately, many VCs, especially newcomers, fail to turn a profit due to a lack of deep industry knowledge. Their primary function often boils down to promoting and supporting their investments through various channels.\n\n![](https://cuckoo-network.b-cdn.net/2024-07-22-venture-capital-blockchain-investment-ceo-insight.webp)\n\n## The Performance of Liquid Funds\n\nCurrently, liquid funds are underperforming compared to Bitcoin (BTC). Historically, they were profitable, but so were individual investors. Liquid fund investors typically already have BTC exposure, forcing these funds to invest in non-BTC assets, which frequently struggle to outperform BTC. If a fund can't beat BTC, it doesn't add value.\n\n## Advanced Blockchain Literacy\n\n### Influencers (KOLs)\n\nNever take influencer content at face value. Their statements often generate noise and serve as tools to gauge project funding and their network. When someone promotes a project, it’s usually because they have financial stakes. Disregard profit and loss screenshots and retrospective analyses. Genuine wealth is often understated, and the most seemingly affluent may not be as wealthy as they appear.\n\n### Centralized Exchanges\n\nInherently distrust centralized exchanges. Avoid using them for contract trading. They can serve as cross-chain bridges or platforms for buying spot currencies, but always be ready to withdraw funds at the slightest hint of FUD (Fear, Uncertainty, Doubt). Using a centralized exchange can be a good career start, providing passive information intake, but success depends on your ability to leverage this information.\n\n## Evaluating Blockchain Projects\n\nTreat statements from project teams with skepticism. Announcements of partnerships often signify minimal progress. Focus on the tangible actions of the project team and evaluate how their work accelerates the value chain. If the outcomes positively influence public perception of token value, the project is worth considering. Be wary of projects with past ethical breaches—they are likely to repeat such behavior.\n\n## Marketing in Blockchain\n\nMost project teams lack effective marketing strategies. It's challenging to quantify marketing success, and metrics often involve inflated figures. Basic marketing budgets are best converted into influencer rounds. Other marketing expenses are less effective than direct market actions like price boosts.\n\n## Individual Investment Approach\n\nFor VC-backed tokens, avoid promoting them publicly but feel free to share sincere insights. For community-driven tokens, engage in community building and advocacy. Trust on-chain data and genuine buy orders. Encourage any form of investor rights protection unless you have conflicting interests. Publicly documenting your learning journey and successes can build trust and credibility.\n\n## Key Takeaways\n\nNavigating the blockchain industry requires skepticism, strategic thinking, and a reliance on verifiable data. Trust actions over words, and always prioritize projects and funds that demonstrate real, measurable progress."
  },
  {
    "id": "/2024/07/18/iotex-2-0-depin-for-everyone",
    "metadata": {
      "permalink": "/blog/2024/07/18/iotex-2-0-depin-for-everyone",
      "source": "@site/blog/2024-07-18-iotex-2-0-depin-for-everyone.md",
      "title": "IoTeX 2.0: Empowering DePIN for Everyone",
      "description": "Discover how IoTeX 2.0 is revolutionizing the DePIN landscape with innovative modular infrastructure, comprehensive tokenomics, and public goods, making decentralized physical infrastructure networks accessible to everyone.",
      "date": "2024-07-18T00:00:00.000Z",
      "formattedDate": "July 18, 2024",
      "tags": [
        {
          "label": "iotex",
          "permalink": "/blog/tags/iotex"
        }
      ],
      "readingTime": 3.175,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "IoTeX 2.0: Empowering DePIN for Everyone",
        "authors": [
          "dora"
        ],
        "tags": [
          "iotex"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/iotex-2-0-depin-for-everyone.webp",
        "description": "Discover how IoTeX 2.0 is revolutionizing the DePIN landscape with innovative modular infrastructure, comprehensive tokenomics, and public goods, making decentralized physical infrastructure networks accessible to everyone."
      },
      "unlisted": false,
      "prevItem": {
        "title": "Realities of Venture Capital and Blockchain Investment",
        "permalink": "/blog/2024/07/22/venture-capital-blockchain-investment-ceo-insight"
      },
      "nextItem": {
        "title": "Announcing the Winners of the Sui Overflow Hackathon!",
        "permalink": "/blog/2024/07/09/sui-overflow-hackathon-winner"
      }
    },
    "content": "Decentralized physical infrastructure network (DePIN) is emerging as a transformative force in the Web3 landscape, offering a new paradigm for building, operating, and managing physical infrastructure networks. However, many DePIN startups face significant challenges due to a lack of funds and technical competence. IoTeX 2.0 aims to address these challenges with a suite of innovations designed to support the DePIN community in realizing the vision of \"DePIN for Everyone!\".\n\n\n![](https://tp-misc.b-cdn.net/blockeden/iotex-2-0-depin-for-everyone.webp)\n\n\n## Core Innovations of IoTeX 2.0\n\n1. **Tokenomic Design**:\n   - A comprehensive utility for IOTX tokens within the modular DePIN infrastructure.\n   - Inflationary staking rewards, deflationary burning mechanisms, and growth incentives to maintain a balanced token supply.\n\n2. **Modular DePIN Infrastructure**:\n   - **Modular Security Pool (MSP)**: Provides a unified trusted layer for DePIN infrastructure modules through restaking.\n   - **W3bstream**: A decentralized multi-prover network for DePIN verification, supporting various validity proof approaches.\n   - **ioID**: A unified identity system managing and securing machine-to-machine and machine-to-person relationships.\n   - **ioConnect**: A universal embedded SDK empowering device abstraction and facilitating smart device interaction.\n   - **ioDDK**: A chain SDK allowing DePIN projects to provision self-sovereign application chains, inheriting IoTeX L1 security.\n\n3. **Public Goods**:\n   - Tools like DePINScan and DePIN Liquidity Hub to support awareness, usability, and liquidity for DePIN projects.\n\n## The Importance of DePIN\n\nDePIN aims to disrupt traditional industries and public utilities, which are often monopolies controlled by centralized corporations and governments. By leveraging blockchain technology, DePIN can bring transparency, trust, and innovation to physical infrastructure and public utilities. This new model allows people to contribute to and build equity in real-world infrastructure networks, overcoming financial and logistical barriers to entry.\n\n## The DePIN Landscape\n\nDePIN is a collective effort of numerous projects across the globe, focusing on decentralizing and improving physical infrastructure. The DePIN sector includes:\n- **Physical Resource Networks**: Produce non-fungible resources relying on location-dependent hardware.\n- **Digital Resource Networks**: Produce marketplaces for fungible resources, relying on location-agnostic hardware.\n- **Infrastructure and Tooling**: Facilitate growth and provide off-the-shelf capabilities for DePIN applications.\n\n## The DePIN Tech Stack and Its Challenges\n\nThe DePIN tech stack requires an end-to-end architecture connecting the real world to the blockchain. This includes layers like hardware abstraction, connectivity, sequencer, data availability, long-term storage, off-chain computing, blockchain, identity, and governance. Developing this complex stack presents high barriers to entry, particularly for emerging markets.\n\n## IoTeX 2.0: A Modular Approach\n\nIoTeX 2.0 introduces a modular infrastructure, allowing DePIN projects to construct a tech stack that suits their specific needs. This approach supports both large and small teams by providing comprehensive and purpose-built solutions. Key components include:\n\n- **Modular Security Pool (MSP)**: Ensures unified and end-to-end trust across DIMs, leveraging staked assets from well-established blockchains.\n- **W3bstream**: Facilitates decentralized off-chain computing with multiple provers, enhancing the scalability and efficiency of DePIN applications.\n- **ioID and ioConnect**: Simplify identity management and hardware abstraction, respectively, enabling seamless integration of smart devices into DePIN projects.\n- **ioDDK**: Supports the launch of self-sovereign L2 blockchains, expanding the capabilities of DePIN projects.\n\n## Future Outlook\n\nIoTeX 2.0 aims to create a new world where physical infrastructure networks are decentralized, transparent, and equitable. By leveraging cutting-edge technologies like zero-knowledge proofs, AI, and blockchain, IoTeX 2.0 envisions a future where smart devices, autonomous systems, and digital resource marketplaces operate seamlessly and securely. This vision empowers everyday people to contribute to and benefit from the modernization of global infrastructure, ensuring \"DePIN for Everyone!\".\n\n## Summary\n\nIoTeX 2.0 is a significant milestone in the evolution of the IoTeX network, addressing the challenges faced by DePIN startups and driving the next phase of growth for decentralized physical infrastructure networks. With its innovative modular infrastructure, comprehensive tokenomics, and commitment to public goods, IoTeX 2.0 is poised to lead the DePIN movement and empower builders worldwide. Are you an IoTeX developer? BlockEden.xyz offers IoTeX RPC at https://blockeden.xyz/api-marketplace/iotex."
  },
  {
    "id": "/2024/07/09/sui-overflow-hackathon-winner",
    "metadata": {
      "permalink": "/blog/2024/07/09/sui-overflow-hackathon-winner",
      "source": "@site/blog/2024-07-09-sui-overflow-hackathon-winner.md",
      "title": "Announcing the Winners of the Sui Overflow Hackathon!",
      "description": "BlockEden.xyz is thrilled to announce the winners of the Sui Overflow Hackathon! After weeks of innovative coding, intense competition, and creative problem-solving, we are proud to present the projects that stood out the most. Congratulations to all the participants for their outstanding contributions. Here are the top winners.",
      "date": "2024-07-09T00:00:00.000Z",
      "formattedDate": "July 9, 2024",
      "tags": [
        {
          "label": "Sui",
          "permalink": "/blog/tags/sui"
        }
      ],
      "readingTime": 2.845,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Announcing the Winners of the Sui Overflow Hackathon!",
        "authors": [
          "dora"
        ],
        "tags": [
          "Sui"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/2024-07-09-sui-overflow-hackathon-winner.webp",
        "description": "BlockEden.xyz is thrilled to announce the winners of the Sui Overflow Hackathon! After weeks of innovative coding, intense competition, and creative problem-solving, we are proud to present the projects that stood out the most. Congratulations to all the participants for their outstanding contributions. Here are the top winners."
      },
      "unlisted": false,
      "prevItem": {
        "title": "IoTeX 2.0: Empowering DePIN for Everyone",
        "permalink": "/blog/2024/07/18/iotex-2-0-depin-for-everyone"
      },
      "nextItem": {
        "title": "Understanding TON: Revolutionizing Blockchain and Formidable Ecosystem",
        "permalink": "/blog/2024/07/08/ton"
      }
    },
    "content": "BlockEden.xyz is thrilled to announce the winners of the Sui Overflow Hackathon! After weeks of innovative coding, intense competition, and creative problem-solving, we are proud to present the projects that stood out the most. Congratulations to all the participants for their outstanding contributions. Here are the top winners:\n\n![](https://tp-misc.b-cdn.net/blockeden/2024-07-09-sui-overflow-hackathon-winner.webp)\n\n## 1st Prize ($1,500 in SUI): Orbital\n**Project Links:**\n- [GitHub Repository](https://github.com/devarogundade/orbital/)\n- [Website](https://myorbital.xyz/)\n\nOrbital is a cutting-edge cross-chain lending platform that leverages wormhole technology and Supra Oracles to revolutionize decentralized finance (DeFi). By enabling seamless and secure lending and borrowing across multiple blockchain networks like SUI and Avalanche, Orbital maximizes liquidity and capital efficiency. The integration of Supra Oracles ensures accurate, real-time data for price feeds and interest rates.\n\nDesigned to feel like a DEX that many blockchain users are accustomed to, Orbital simplifies the user experience with a unified interface where users can manage all transactions from a single dashboard. This intuitive design makes it just one-click to borrow, transforming the traditional DeFi landscape.\n\n## 2nd Prize ($1,000 in SUI): Liquidity Garden\n**Project Link:**\n- [Website](https://liquidity-garden.vercel.app/)\n\nLiquidity Garden is an innovative farm simulation game where players build and manage their own farm garden. Players stake liquidity from FlowX DEX to buy NFT seeds, water them daily, and watch as dynamic NFTs grow and release $OXYGEN tokens. With additional features like raising pets and integrating token swaps directly in the game, Liquidity Garden provides a unique blend of gaming and DeFi, encouraging continuous engagement and interaction.\n\n## 3rd Prize ($100 in SUI): BioWallet, Cocktail OTC Market, SharkyTheSuiBot, Zomdev\n\n### BioWallet\n**Project Links:**\n- [GitHub Repository](https://github.com/Nilay27/BioWallet)\n- [Website](https://biowallet.my.canva.site/)\n\nBioWallet transforms devices into secure hardware wallets by leveraging biometric-based onboarding. This innovative digital wallet eliminates the need for traditional seed phrases, storing private keys securely in the Secure Enclave. With advanced features like MultiSig and WebAuthn, BioWallet offers top-notch protection and flexibility, bridging the gap between traditional browser wallets and hardware wallets.\n\n### Cocktail OTC Market\n**Project Links:**\n- [GitHub Repository](https://github.com/0xtail-hackathon/sui-overflow-2024)\n- [Website](https://0xtail-hackathon.github.io/sui-overflow-2024/)\n\nCocktail OTC Market provides a seamless platform for token transactions without the need for a centralized exchange. Sellers can list their tokens with flexible pricing, and buyers can browse and purchase tokens easily. Managed by Sui contracts, Cocktail OTC Market ensures secure and transparent transactions, making it a reliable solution for token trading.\n\n### SharkyTheSuiBot\n**Project Links:**\n- [GitHub Repository](https://github.com/CryptoInnovators/sharkythesuibot)\n- [Telegram](https://t.me/sharkythesuibot)\n\nSharkyTheSuiBot is the fastest SUI Telegram bot designed to find and exploit arbitrage opportunities across different SUI DEXs. It performs trading activities based on script-logic strategies, offers real-time price fetching, and enables users to provide liquidity in pools directly from the bot. With advanced features like flash loans and real-time charts, SharkyTheSuiBot enhances the user trading experience.\n\n### Zomdev\n**Project Links:**\n- [GitHub Repository](https://github.com/RevanthGundala/zomdev)\n- [Website](https://zomdev.com)\n\nZomdev is a developer bounty system where companies post bounties for GitHub issues or talent acquisition, and developers can claim these bounties based on project submissions. This platform facilitates a dynamic interaction between companies seeking development assistance and developers looking for opportunities to earn and showcase their skills.\n\n## Final Words\n\nCongratulations to all the winners and participants! Your innovative solutions and creative ideas have made this hackathon a remarkable success. We look forward to seeing how these projects evolve and continue to impact the blockchain and DeFi landscape.\n\nStay tuned for more updates and future hackathons from BlockEden.xyz!\n\n------\n\n- Twitter: [https://twitter.com/BlockEdenHQ](https://twitter.com/BlockEdenHQ)\n- Discord: [https://discord.gg/4Yfvs2HWey](https://discord.gg/4Yfvs2HWey)\n- Source Link: https://blockeden.xyz/blog/2024/07/09/sui-overflow-hackathon-winner/"
  }
]