[
  {
    "id": "/2023/06/02/stake-sui-with-blockeden-xyz",
    "metadata": {
      "permalink": "/blog/2023/06/02/stake-sui-with-blockeden-xyz",
      "source": "@site/blog/2023-06-02-stake-sui-with-blockeden-xyz.mdx",
      "title": "Stake SUI and earn rewards with BlockEden.xyz",
      "description": "Earning rewards by staking your SUI with BlockEden.xyz through the Sui Wallet, Martian Wallet, or Suiet! We're excited to announce that SUI staking on Mainnet is finally accessible, providing an opportunity for you to generate passive income from your $SUI by earning staking rewards. This guide will explain, step by step, how to use your preferred Sui wallets: Sui Wallet, Suiet, and Martian Wallet.",
      "date": "2023-06-02T00:00:00.000Z",
      "formattedDate": "June 2, 2023",
      "tags": [
        {
          "label": "staking",
          "permalink": "/blog/tags/staking"
        },
        {
          "label": "sui",
          "permalink": "/blog/tags/sui"
        }
      ],
      "readingTime": 7.61,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Stake SUI and earn rewards with BlockEden.xyz",
        "authors": [
          "dora"
        ],
        "tags": [
          "staking",
          "sui"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz.png"
      },
      "unlisted": false,
      "prevItem": {
        "title": "An Exploration of a16z Crypto Startup School Projects",
        "permalink": "/blog/2023/06/08/exploration-a16z-crypto-startup-school-projects"
      },
      "nextItem": {
        "title": "How does Etherscan make money?",
        "permalink": "/blog/2023/05/30/how-does-etherscan-make-money"
      }
    },
    "content": "Earning rewards by staking your SUI with BlockEden.xyz through the Sui Wallet, Martian Wallet, or Suiet! We're excited to announce that SUI staking on Mainnet is finally accessible, providing an opportunity for you to generate passive income from your $SUI by earning staking rewards. This guide will explain, step by step, how to use your preferred Sui wallets: Sui Wallet, Suiet, and Martian Wallet.\n\n- [Staking SUI with Sui Wallet](#staking-sui-with-sui-wallet)\n- [Staking SUI with Martian Wallet](#staking-sui-with-martian-wallet)\n- [Staking SUI with Suiet](#steps-to-stake-sui-using-suiet)\n- [Staking SUI with Ethos Wallet](#staking-sui-with-ethos)\n\n## Staking SUI with Sui Wallet\n\nFirst, you'll need to install the Sui Wallet [browser extension](https://chrome.google.com/webstore/detail/sui-wallet/opcgpfmipidbgpenhmajoajpbobppdil?ref=BlockEden.xyz). Currently, Sui Wallet is available exclusively on Chrome, though future updates may include support for other browsers. If you aren't using Chrome and wish to stake SUI, consider using the other wallets discussed in this guide.\n\nTo create your wallet, click on \"Get Started\", then \"Create a New Wallet\". If you already have a wallet, you can import it by clicking on \"Import an Existing Wallet\".\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-01.png)\n\nNow you need to set a password. It's recommended to choose a strong password with a minimum of 12 characters, including numbers, letters, and symbols. Also, be sure to write your password down and store it in a safe, offline location. Once you've agreed to the terms and conditions, select \"Create Wallet\".\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-02.png)\n\nMake sure to note down your recovery phrase in a secure place, preferably offline. It's crucial for future access to your SUI.\n\n<div style={{ display: \"flex\", width: \"100%\", justifyContent: \"center\" }}>\n  <iframe\n    src=\"https://blockedenxyz.substack.com/embed\"\n    width=\"480\"\n    height=\"320\"\n    frameborder=\"0\"\n    scrolling=\"no\"\n  ></iframe>\n</div>\n\n\n### Staking Your SUI\n\nAfter your wallet is set up, it's time to stake! On the dashboard, click \"Stake & Earn SUI\". Choose your desired validator from the list, confirm your selection, and click on the validator.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-03.png)\n\nNext, specify the quantity of SUI you want to stake. Verify all details before clicking \"Stake Now\".\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-04-a.png)\n\nUpon successful transaction confirmation, your stake will begin to earn rewards from the beginning of the next epoch. There's no need to restake as rewards are automatically compounded.\n\n### Unstaking SUI with Sui Wallet\n\nTo claim or unstake your SUI, click \"Currently Staked\". You'll see a list of your validators. From this list, select the validator with whom you'd like to unstake.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-05.png)\n\nThen, click on \"Unstake SUI\". Verify all details before confirming with \"Unstake Now\".\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-06.png)\n\nCongratulations! You've successfully unstaked your SUI.\n\n## Staking SUI with Martian Wallet\n\nFirstly, download the [Martian Wallet](https://martianwallet.xyz/?ref=BlockEden.xyz) app and set up your wallet account. Be sure to download the browser extension using the official website’s download button. Once the extension is added to your browser, Martian Wallet will open.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-07.png)\n\nOn the \"start\" screen, click \"Create a New Wallet\" to initiate the process. If you already have a wallet, select \"I already have a Wallet\", enter your private phrase, and recover your wallet.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-08.png)\n\nAs before, set a secure password of at least 12 characters, mixing numbers, letters, and symbols. After selecting your password and agreeing to the terms and conditions, click \"Continue\".\n\nYour recovery or seed phrase will be presented next. Remember to securely store this phrase offline and not to share it with anyone. It's vital for future access to your assets.\n\n### Staking Your SUI\n\nWith your account ready, you can now start staking. In the Martian extension dashboard, click \"Stake your SUI\". Scroll to find and select your desired validator.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-09.png)\n\nEnter the amount of SUI you want to stake and remember to reserve some SUI for gas fees. The minimum staking amount is 1 SUI. After filling this out, click \"Preview\".\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-10.png)\n\nFinally, verify all the details on the pop-up, including the staked amount and gas fees. If everything is correct, click \"Confirm and Stake\". A \"Success\" message should appear shortly, indicating a successful stake. You can now close the window, and your stake will start earning rewards from the next epoch.\n\n### Process for Unstaking or Claiming with Martian Wallet\n\nUnstaking your SUI from Martian Wallet is a straightforward process. Begin by navigating to the Home screen and selecting “Stake”. From there, you will be presented with a list of all your staked SUI and their respective epochs on the stake dashboard. Please note that you must unstake all SUI at the same time. Identify the SUI you wish to unstake, click on it, and then select “Unstake”. After a brief wait, your assets will be unstaked, congratulations!\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-11.png)\n\n## Steps to Stake SUI using Suiet\n\nTo start, you need to download the Suiet Wallet extension. This can be done by visiting the [official Suiet website](https://suiet.app/?ref=BlockEden.xyz), where you should select the download option that best suits your needs. Please exercise caution and ensure you download the wallet from the official Suiet site.\n\nAfter downloading and installing the extension, you'll need to set it up. To do so, open the extension and click on “Create Wallet”.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-12.png)\n\nThe next step is to create a secure password that includes a mix of capital and lowercase letters, symbols, and numbers, with a minimum length of 12 characters. Safely record this password, preferably offline, then proceed to the next step.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-13.png)\n\nYou'll then be given a recovery phrase, which is vital for future access to your assets. It is paramount that you keep this phrase confidential and store it in a secure location, preferably offline.\n\n<div style={{ display: \"flex\", width: \"100%\", justifyContent: \"center\" }}>\n  <iframe\n    src=\"https://blockedenxyz.substack.com/embed\"\n    width=\"480\"\n    height=\"320\"\n    frameborder=\"0\"\n    scrolling=\"no\"\n  ></iframe>\n</div>\n\n\n### Staking Your SUI\n\nWith the preparation complete, it's now time to stake your SUI. Start by going to the dashboard and selecting “SUI”, then choose “Stake”.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-14.png)\n\nOn the top of the dashboard, you'll find a list of validators. Select your preferred validator and decide on the amount of SUI you wish to stake. Remember to keep some SUI reserved for gas fees and future transactions. Once everything is in order, confirm the transaction.\n\nOnce the transaction is confirmed, your stake will start accruing rewards from the start of the next epoch.\n\n### How to Claim or Unstake SUI with Suiet\n\nClaiming your SUI rewards or unstaking your SUI with the Suiet wallet is a straightforward process. Just navigate to your staked assets, click on the one you wish to handle, and select “Unstake”. After a brief wait, you will receive a confirmation of successful unstaking. It's as simple as that!\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-15.png)\n\n## Staking SUI with Ethos\n\nSimilar to the other wallets, you first need to create your wallet to stake SUI with Ethos. Visit the official [Ethos Wallet for Sui website](https://ethoswallet.xyz/?ref=BlockEden.xyz) to start.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-16.png)\n\nOnce the Ethos extension is downloaded and installed, click on “Generate New Wallet” and create a secure password, following the same guidelines as mentioned before. Write down your password securely.\n\nYou will then be provided with a recovery or seed phrase. Remember, this phrase is essential for accessing your assets in the future and should not be shared with anyone. Safely store this phrase, preferably offline.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-17.png)\n\nEthos also gives you the option to customize your wallet with a color and emoji. This step doesn't affect the wallet's security and can be skipped or completed based on personal preference.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-18.png)\n\n<div style={{ display: \"flex\", width: \"100%\", justifyContent: \"center\" }}>\n  <iframe\n    src=\"https://blockedenxyz.substack.com/embed\"\n    width=\"480\"\n    height=\"320\"\n    frameborder=\"0\"\n    scrolling=\"no\"\n  ></iframe>\n</div>\n\n\n### Staking Process for SUI with Ethos\n\nFor staking on Ethos, select “staking” on the dashboard. From the list of validators, select your desired one and proceed.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-19.png)\n\nEnter the amount of SUI you wish to stake, taking care to reserve some for gas fees and future transactions. Review the transaction details and if everything seems fine, click “Review”, and then “Confirm”. A message stating “Staking Complete!” should appear shortly. Your staked SUI will start earning rewards from the next epoch.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-20.png)\n\nYou'll need to wait for an epoch (24 hours) to unstake your SUI. The rewards on SUI are auto-compounded, so you won't have to restake your rewards.\n\n### Claiming SUI Rewards with Ethos\n\nTo claim your SUI rewards, navigate to \"staking\" on Ethos's top right menu. This will open up your staking overview where you can see your accumulated rewards.\n\nFor unstaking, select the validator you wish to unstake with and click “Unstake SUI”. Confirm your decision and that's it, you've unstaked your SUI.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-21.png)\n\nRemember, staking not only provides rewards but also contributes to the SUI ecosystem and aids in securing the blockchain network.\n\n![](https://tp-misc.b-cdn.net/blockeden/stake-sui-with-blockeden-xyz-22.png)\n\n## Closing Remarks\n\nStaking plays a key role in ensuring the sustainability and security of blockchain networks. By staking your digital assets, you help in operating the network and get rewarded for it. For those interested in staking SUI or learning more about this process, you can reach out to BlockEden.xyz through their [Website](https://blockeden.xyz/?ref=BlockEden.xyz), [Twitter](https://twitter.com/blockedenhq?ref=BlockEden.xyz), [Blog](https://blockeden.xyz/blog/), or join the [Discord](https://discord.gg/4Yfvs2HWey?ref=BlockEden.xyz) community.\n\n------\n\nDISCLAIMER: This article does not provide financial advice. Staking, delegation, and cryptocurrencies involve considerable risk, and there is always the possibility of loss, including the loss of all staked digital assets. Delegators may face the risk of slashing in case of security or liveness faults on certain protocols. It is advised that you do thorough research before choosing a validator."
  },
  {
    "id": "/2023/05/18/dive-into-blockchain-programming-with-sui-move",
    "metadata": {
      "permalink": "/blog/2023/05/18/dive-into-blockchain-programming-with-sui-move",
      "source": "@site/blog/2023-05-18-dive-into-blockchain-programming-with-sui-move.mdx",
      "title": "Dive into Blockchain Programming with Sui Move",
      "description": "Blockchain technology has emerged as a leading force in the digital world, offering revolutionary solutions that extend beyond cryptocurrency. Programming languages dedicated to blockchain technology are carving a unique space for themselves. Among these languages, Move has secured a significant spot, thanks to its robustness and inherent security features. Today, we will introduce an innovative tutorial called \"Sui Move,\" designed to teach developers the Move programming language using a learn-by-example approach.",
      "date": "2023-05-18T00:00:00.000Z",
      "formattedDate": "May 18, 2023",
      "tags": [
        {
          "label": "sui",
          "permalink": "/blog/tags/sui"
        },
        {
          "label": "tutorial",
          "permalink": "/blog/tags/tutorial"
        }
      ],
      "readingTime": 3.115,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Dive into Blockchain Programming with Sui Move",
        "authors": [
          "dora"
        ],
        "tags": [
          "sui",
          "tutorial"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/a_software_engineer_learning_coding_cinematic_portrait.png"
      },
      "unlisted": false,
      "prevItem": {
        "title": "How does Etherscan make money?",
        "permalink": "/blog/2023/05/30/how-does-etherscan-make-money"
      },
      "nextItem": {
        "title": "A Fresh Perspective on the Changing Landscape of DeFi Market",
        "permalink": "/blog/2023/05/14/a-fresh-perspective-on-the-changing-landscape-of-defi-market"
      }
    },
    "content": "Blockchain technology has emerged as a leading force in the digital world, offering revolutionary solutions that extend beyond cryptocurrency. Programming languages dedicated to blockchain technology are carving a unique space for themselves. Among these languages, Move has secured a significant spot, thanks to its robustness and inherent security features. Today, we will introduce an innovative tutorial called \"Sui Move,\" designed to teach developers the Move programming language using a learn-by-example approach.\n\n![Dive into Blockchain Programming with Sui Move](https://tp-misc.b-cdn.net/blockeden/a_software_engineer_learning_coding_cinematic_portrait.png \"Dive into Blockchain Programming with Sui Move\")\n\n## Understanding Move: The Programming Language\n\nBefore we jump into the tutorial, let's briefly recap what Move is. Created by Facebook's subsidiary, Diem Association (formerly Libra), Move is a statically-typed, resource-oriented programming language. Its design is centered around enforcing safety and security, making it the ideal language for coding blockchain and cryptocurrency projects. The Sui Move is a variant of the Move programming language.\n\nResources in Move are a key construct that makes it stand out from other blockchain programming languages. These are special types that can't be copied or discarded, only moved between storage locations. This feature allows for precise control over digital assets and significantly mitigates the risk of common security issues, such as double-spending.\n\n<div style={{ display: \"flex\", width: \"100%\", justifyContent: \"center\" }}>\n  <iframe\n    src=\"https://blockedenxyz.substack.com/embed\"\n    width=\"480\"\n    height=\"320\"\n    frameborder=\"0\"\n    scrolling=\"no\"\n  ></iframe>\n</div>\n\n\n## Sui Move: A Learn-by-Example Tutorial\n\nLocated at [https://blockeden.xyz/docs/sui/sui-move/intro/](https://blockeden.xyz/docs/sui/sui-move/intro/), \"Sui Move\" is a comprehensive, learn-by-example tutorial designed to teach developers how to code using the Move programming language.\n\n\"Sui Move\" is constructed on the philosophy that hands-on learning accelerates comprehension and proficiency. The tutorial is divided into small, manageable chunks, each focusing on a specific aspect of Move. This allows learners to not only understand the technicalities of the language but also gain insights into how and where they can be implemented.\n\n\"Sui Move\" stands out in its approach to teaching. Instead of overwhelming the learner with dense theory, it offers an array of examples for every concept. The learner can directly interact with these examples, providing a dynamic learning environment that encourages exploration and understanding at a deep level.\n\nThe tutorial is designed to be accessible for various experience levels. Whether you are a seasoned developer looking to dive into blockchain development or a beginner who's just starting, \"Sui Move\" is tailored to ensure you grasp and master the concepts effectively.\n\n## What You'll Learn\n\n\"Sui Move\" covers a broad range of topics that form the core of Move programming language. Here's a snapshot of what you can expect:\n\n- Understanding the syntax and structure of Move.\n- Deep dive into Move's unique resource-oriented model.\n- Manipulating data using Move's functions and methods.\n- Learning to create and implement Modules and Scripts.\n- Handling exceptions and ensuring security in your Move programs.\n- Learning how to create a custom coin and NFT.\n\n## Why Choose Sui Move?\n\n\"Sui Move\" is not just a tutorial; it's a well-structured learning journey. It offers:\n\n1. **Real-world Examples:** Every concept is paired with a practical example that demonstrates how to use it effectively.\n2. **Comprehensive Coverage:** It provides a thorough understanding of Move, from basic syntax to advanced constructs.\n3. **Step-by-Step Guidance:** Every module is designed to gradually build your understanding, reducing the learning curve and making complex concepts easier to grasp.\n5. **Flexibility:** It caters to a wide range of learners, from beginners to experienced developers.\n\nBlockchain technology is shaping the future of numerous industries, and mastering a language like Move can open new avenues for developers. With \"Sui Move,\" you have a resource that can guide you effectively through your learning journey. So, dive in, start coding, and explore the exciting opportunities that Move and blockchain technology hold for you.\n\nGet started now at https://blockeden.xyz/docs/sui/sui-move/intro/."
  },
  {
    "id": "/2023/05/03/welcomes-the-successful-launch-of-sui-mainnet",
    "metadata": {
      "permalink": "/blog/2023/05/03/welcomes-the-successful-launch-of-sui-mainnet",
      "source": "@site/blog/2023-05-03-welcomes-the-successful-launch-of-sui-mainnet.mdx",
      "title": "Sui Mainnet Launch: BlockEden.xyz Expands API Suite to Include Next-Generation Blockchain Platform",
      "description": "We are thrilled to announce that Sui, the highly anticipated blockchain platform, has successfully launched its mainnet. At BlockEden.xyz, we are committed to providing our customers with the most innovative and cutting-edge solutions in the blockchain industry. As a result, we are excited to integrate Sui into our robust API suite, offering developers an even greater range of tools to create groundbreaking applications.",
      "date": "2023-05-03T00:00:00.000Z",
      "formattedDate": "May 3, 2023",
      "tags": [
        {
          "label": "product",
          "permalink": "/blog/tags/product"
        },
        {
          "label": "sui",
          "permalink": "/blog/tags/sui"
        }
      ],
      "readingTime": 2.895,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Sui Mainnet Launch: BlockEden.xyz Expands API Suite to Include Next-Generation Blockchain Platform",
        "authors": [
          "dora"
        ],
        "tags": [
          "product",
          "sui"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/sui-mainnet-rpc-launch.png"
      },
      "unlisted": false,
      "prevItem": {
        "title": "BRC20 Tokens: A Promising Contender or a Mere Flash in the Pan?",
        "permalink": "/blog/2023/05/04/BRC20"
      },
      "nextItem": {
        "title": "297k TPS! Sui Network's Impressive Performance Update: A Look at Throughput and Time to Finality",
        "permalink": "/blog/2023/04/28/297k-tps-sui-network-s-impressive-performance-update"
      }
    },
    "content": "We are thrilled to announce that Sui, the highly anticipated blockchain platform, has successfully launched its mainnet. At BlockEden.xyz, we are committed to providing our customers with the most innovative and cutting-edge solutions in the blockchain industry. As a result, we are excited to integrate Sui into our robust API suite, offering developers an even greater range of tools to create groundbreaking applications.\n\n![Sui Mainnet Launch: BlockEden.xyz Expands API Suite to Include Next-Generation](https://tp-misc.b-cdn.net/blockeden/sui-mainnet-rpc-launch.png \"Sui Mainnet Launch: BlockEden.xyz Expands API Suite to Include Next-Generation\")\n\n## Why Sui Matters\n\nSui is a next-generation blockchain platform designed to address the challenges faced by existing solutions in scalability, interoperability, and energy efficiency. It brings together the best features from various blockchain technologies, offering a more efficient and flexible platform for developers to build decentralized applications (dApps) and smart contracts. Some key aspects of Sui include:\n\n1. Scalability: Sui employs a unique consensus algorithm, which allows it to process [297k transactions per second](https://blockeden.xyz/blog/2023/04/28/297k-tps-sui-network-s-impressive-performance-update/), thus ensuring high throughput and minimal latency. This makes it an ideal choice for building dApps that require fast and secure transactions.\n3. Energy Efficiency: Sui's consensus algorithm also addresses the energy consumption concerns associated with traditional Proof-of-Work (PoW) mechanisms. By utilizing a more environmentally friendly approach, Sui contributes to a greener and more sustainable blockchain industry.\n\nWhat This Means for BlockEden.xyz Users:\n\nAs Sui joins our API suite, developers can look forward to:\n\n1. Access to Sui's Blockchain: Our API will enable developers to easily interact with the Sui blockchain, allowing them to build and deploy smart contracts, create tokens, and develop dApps on this revolutionary platform.\n2. Continued Support: BlockEden.xyz remains committed to providing exceptional customer support, offering guidance and assistance in implementing Sui's technology within your projects.\n3. Stake with BlockEden.xyz and Earn Rewards: By staking your tokens with BlockEden.xyz, you can participate in the Sui ecosystem and earn rewards for contributing to the platform's growth and security.\n\n<div style={{ display: \"flex\", width: \"100%\", justifyContent: \"center\" }}>\n  <iframe\n    src=\"https://blockedenxyz.substack.com/embed\"\n    width=\"480\"\n    height=\"320\"\n    frameborder=\"0\"\n    scrolling=\"no\"\n  ></iframe>\n</div>\n\n\n## Getting Started with BlockEden.xyz's Sui RPC Key\n\nIf you're ready to start developing on the Sui blockchain using BlockEden.xyz's API suite, follow these simple steps to get your Sui RPC key and kickstart your project:\n\nStep 1: Obtain a Connection String\n\nVisit our API Marketplace at https://blockeden.xyz/api-marketplace to obtain a connection string. This string will enable you to access the Sui blockchain through our API and begin developing your decentralized application.\n\nStep 2: Develop Your First Sui DApp\n\nTo build your first DApp on the Sui platform, follow our comprehensive guide available at https://blockeden.xyz/docs/sui/sui-typescript-sdk/. This tutorial provides step-by-step instructions for setting up your development environment, implementing Sui's TypeScript SDK, and creating a fully functional DApp using the Sui blockchain.\n\nBy following these steps, you'll be well on your way to harnessing the power of the Sui blockchain and BlockEden.xyz's API suite to develop innovative and groundbreaking decentralized applications. If you need any assistance, our dedicated support team is always ready to help guide you through the process.\n\n## Conclusion\n\nBlockEden.xyz is proud to welcome Sui into our growing family of blockchain technologies. By adding Sui to our API suite, we are further expanding the possibilities for developers to create groundbreaking solutions in the blockchain space. As always, we remain dedicated to providing our users with the most innovative and reliable tools to empower their projects and drive the future of decentralized technology.\n\n- Twitter: https://twitter.com/BlockEdenHQ\n- Discord: https://discord.gg/4Yfvs2HWey\n- Source Link: https://blockeden.xyz/blog/2023/05/03/welcomes-the-successful-launch-of-sui-mainnet/"
  }
]