[
  {
    "id": "/2024/12/22/why-big-tech-is-betting-on-ethereum-hidden-forces-driving-web3-adoption",
    "metadata": {
      "permalink": "/blog/2024/12/22/why-big-tech-is-betting-on-ethereum-hidden-forces-driving-web3-adoption",
      "source": "@site/blog/2024-12-22-why-big-tech-is-betting-on-ethereum-hidden-forces-driving-web3-adoption.md",
      "title": "Why Big Tech is Betting on Ethereum: The Hidden Forces Driving Web3 Adoption",
      "description": "In 2024, major tech companies are deploying critical workloads on Ethereum's mainnet, signaling a shift in enterprise technology. This article explores the decline of private blockchains, the rise of Ethereum, and the strategic forces driving this transformation.",
      "date": "2024-12-22T00:00:00.000Z",
      "formattedDate": "December 22, 2024",
      "tags": [
        {
          "label": "Ethereum",
          "permalink": "/blog/tags/ethereum"
        },
        {
          "label": "Web3",
          "permalink": "/blog/tags/web-3"
        },
        {
          "label": "Big Tech",
          "permalink": "/blog/tags/big-tech"
        },
        {
          "label": "Blockchain",
          "permalink": "/blog/tags/blockchain"
        },
        {
          "label": "Enterprise Technology",
          "permalink": "/blog/tags/enterprise-technology"
        }
      ],
      "readingTime": 3.915,
      "hasTruncateMarker": false,
      "authors": [],
      "frontMatter": {
        "title": "Why Big Tech is Betting on Ethereum: The Hidden Forces Driving Web3 Adoption",
        "tags": [
          "Ethereum",
          "Web3",
          "Big Tech",
          "Blockchain",
          "Enterprise Technology"
        ],
        "keywords": [
          "Ethereum adoption",
          "Web3",
          "Big Tech blockchain",
          "enterprise blockchain",
          "Ethereum Layer 2",
          "zero-knowledge proofs",
          "blockchain infrastructure"
        ],
        "description": "In 2024, major tech companies are deploying critical workloads on Ethereum's mainnet, signaling a shift in enterprise technology. This article explores the decline of private blockchains, the rise of Ethereum, and the strategic forces driving this transformation.",
        "image": "https://web-dash-v2.onrender.com/api/og?title=Why%20Big%20Tech%20is%20Betting%20on%20Ethereum:%20The%20Hidden%20Forces%20Driving%20Web3%20Adoption"
      },
      "unlisted": false,
      "nextItem": {
        "title": "Can 0G’s Decentralized AI Operating System Truly Drive AI On-Chain at Scale?",
        "permalink": "/blog/2024/12/15/0g-labs"
      }
    },
    "content": "In 2024, something remarkable is happening: Big Tech is not just exploring blockchain; it's deploying critical workloads on Ethereum's mainnet. Microsoft processes over 100,000 supply chain verifications daily through their Ethereum-based system, JP Morgan's pilot has settled $2.3 billion in securities transactions, and Ernst & Young's blockchain division has grown 300% year-over-year building on Ethereum.\n\n![Ethereum Adoption](https://web-dash-v2.onrender.com/api/og?title=Why%20Big%20Tech%20is%20Betting%20on%20Ethereum:%20The%20Hidden%20Forces%20Driving%20Web3%20Adoption)\n\nBut the most compelling story isn't just that these giants are embracing public blockchains—it's *why* they're doing it now and what their $4.2 billion in combined Web3 investments tells us about the future of enterprise technology.\n\n## The Decline of Private Blockchains Was Inevitable (But Not for the Reasons You Think)\n\nThe fall of private blockchains like Hyperledger and Quorum has been widely documented, but their failure wasn't just about network effects or being \"expensive databases.\" It was about **timing** and **ROI**.\n\nConsider the numbers: The average enterprise private blockchain project in 2020-2022 cost \\$3.7 million to implement and yielded just $850,000 in cost savings over three years (according to Gartner). In contrast, early data from Microsoft's public Ethereum implementation shows a 68% reduction in implementation costs and 4x greater cost savings.\n\nPrivate blockchains were a technological anachronism, created to solve problems enterprises didn't yet fully understand. They aimed to de-risk blockchain adoption but instead created isolated systems that couldn't deliver value.\n\n## The Three Hidden Forces Accelerating Enterprise Adoption (And One Major Risk)\n\nWhile Layer 2 scalability and regulatory clarity are often cited as drivers, three deeper forces are actually reshaping the landscape:\n\n### 1. **The \"AWSification\" of Web3**\n\nJust as AWS abstracted infrastructure complexity (reducing average deployment times from 89 days to 3 days), Ethereum's Layer 2s have transformed blockchain into consumable infrastructure. Microsoft's supply chain verification system went from concept to production in 45 days on Arbitrum—a timeline that would have been impossible two years ago.\n\nThe data tells the story: Enterprise deployments on Layer 2s have grown 780% since January 2024, with average deployment times falling from 6 months to 6 weeks.\n\n### 2. **The Zero-Knowledge Revolution**\n\nZero-knowledge proofs haven't just solved privacy—they've reinvented the trust model. The technological breakthrough can be measured in concrete terms: EY's Nightfall protocol can now process private transactions at 1/10th the cost of previous privacy solutions while maintaining complete data confidentiality.\n\nCurrent enterprise ZK implementations include:\n- Microsoft: Supply chain verification (100k tx/day)\n- JP Morgan: Securities settlement ($2.3B processed)\n- EY: Tax reporting systems (250k entities)\n\n### 3. **Public Chains as a Strategic Hedge**\n\nThe strategic value proposition is quantifiable. Enterprises spending on cloud infrastructure face average vendor lock-in costs of 22% of their total IT budget. Building on public Ethereum reduces this to 3.5% while maintaining the benefits of network effects.\n\n### The Counter Argument: The Centralization Risk\n\nHowever, this trend faces one significant challenge: the risk of centralization. Current data shows that 73% of enterprise Layer 2 transactions are processed by just three sequencers. This concentration could recreate the same vendor lock-in problems enterprises are trying to escape.\n\n## The New Enterprise Technical Stack: A Detailed Breakdown\n\nThe emerging enterprise stack reveals a sophisticated architecture:\n\nSettlement Layer (Ethereum Mainnet):\n- Finality: 12 second block times\n- Security: $2B in economic security\n- Cost: $15-30 per settlement\n\nExecution Layer (Purpose-built L2s):\n- Performance: 3,000-5,000 TPS\n- Latency: 2-3 second finality\n- Cost: $0.05-0.15 per transaction\n\nPrivacy Layer (ZK Infrastructure):\n- Proof Generation: 50ms-200ms\n- Verification Cost: ~$0.50 per proof\n- Data Privacy: Complete\n\nData Availability:\n- Ethereum: $0.15 per kB\n- Alternative DA: $0.001-0.01 per kB\n- Hybrid Solutions: Growing 400% QoQ\n\n## What's Next: Three Predictions for 2025\n\n1. **Enterprise Layer 2 Consolidation**\nThe current fragmentation (27 enterprise-focused L2s) will consolidate to 3-5 dominant platforms, driven by security requirements and standardization needs.\n\n2. **Privacy Toolkit Explosion**\nFollowing EY's success, expect 50+ new enterprise privacy solutions by Q4 2024. Early indicators show 127 privacy-focused repositories under development by major enterprises.\n\n3. **Cross-Chain Standards Emergence**\nWatch for the Enterprise Ethereum Alliance to release standardized cross-chain communication protocols by Q3 2024, addressing the current fragmentation risks.\n\n## Why This Matters Now\n\nThe mainstreaming of Web3 marks the evolution from \"permissionless innovation\" to \"permissionless infrastructure.\" For enterprises, this represents a $47 billion opportunity to rebuild critical systems on open, interoperable foundations.\n\nSuccess metrics to watch:\n- Enterprise TVL Growth: Currently $6.2B, growing 40% monthly\n- Development Activity: 4,200+ active enterprise developers\n- Cross-chain Transaction Volume: 15M monthly, up 900% YTD\n- ZK Proof Generation Costs: Falling 12% monthly\n\nFor Web3 builders, this isn't just about adoption—it's about co-creating the next generation of enterprise infrastructure. The winners will be those who can bridge the gap between crypto innovation and enterprise requirements while maintaining the core values of decentralization."
  },
  {
    "id": "/2024/12/15/0g-labs",
    "metadata": {
      "permalink": "/blog/2024/12/15/0g-labs",
      "source": "@site/blog/2024-12-15-0g-labs.md",
      "title": "Can 0G’s Decentralized AI Operating System Truly Drive AI On-Chain at Scale?",
      "description": "0G Labs has raised $40 million to develop a decentralized AI operating system that aims to revolutionize AI applications on-chain. This article examines 0G's architecture, incentive mechanics, and potential to achieve high throughput for AI on Web3.",
      "date": "2024-12-15T00:00:00.000Z",
      "formattedDate": "December 15, 2024",
      "tags": [
        {
          "label": "AI",
          "permalink": "/blog/tags/ai"
        },
        {
          "label": "blockchain",
          "permalink": "/blog/tags/blockchain"
        },
        {
          "label": "decentralized systems",
          "permalink": "/blog/tags/decentralized-systems"
        },
        {
          "label": "Web3",
          "permalink": "/blog/tags/web-3"
        },
        {
          "label": "0G Labs",
          "permalink": "/blog/tags/0-g-labs"
        }
      ],
      "readingTime": 10.99,
      "hasTruncateMarker": false,
      "authors": [],
      "frontMatter": {
        "title": "Can 0G’s Decentralized AI Operating System Truly Drive AI On-Chain at Scale?",
        "tags": [
          "AI",
          "blockchain",
          "decentralized systems",
          "Web3",
          "0G Labs"
        ],
        "keywords": [
          "0G Labs",
          "decentralized AI",
          "blockchain",
          "AI operating system",
          "Web3",
          "data availability",
          "decentralized storage"
        ],
        "description": "0G Labs has raised $40 million to develop a decentralized AI operating system that aims to revolutionize AI applications on-chain. This article examines 0G's architecture, incentive mechanics, and potential to achieve high throughput for AI on Web3.",
        "image": "https://web-dash-v2.onrender.com/api/og?title=Can%200G’s%20Decentralized%20AI%20Operating%20System%20Truly%20Drive%20AI%20On-Chain%20at%20Scale?"
      },
      "unlisted": false,
      "prevItem": {
        "title": "Why Big Tech is Betting on Ethereum: The Hidden Forces Driving Web3 Adoption",
        "permalink": "/blog/2024/12/22/why-big-tech-is-betting-on-ethereum-hidden-forces-driving-web3-adoption"
      },
      "nextItem": {
        "title": "The Radiant Capital Hack: How North Korean Hackers Used a Single PDF to Steal Hundreds of Millions",
        "permalink": "/blog/2024/12/12/radiant-capital-hack"
      }
    },
    "content": "On November 13, 2024, **0G Labs** announced a **$40 million funding** round led by Hack VC, Delphi Digital, OKX Ventures, Samsung Next, and Animoca Brands, thrusting the team behind this decentralized AI operating system into the spotlight. Their modular approach combines decentralized storage, data availability verification, and decentralized settlement to enable AI applications on-chain. But can they realistically achieve GB/s-level throughput to fuel the next era of AI adoption on Web3? This in-depth report evaluates 0G’s architecture, incentive mechanics, ecosystem traction, and potential pitfalls, aiming to help you gauge whether 0G can deliver on its promise.\n\n![](https://web-dash-v2.onrender.com/api/og?title=Can%200G’s%20Decentralized%20AI%20Operating%20System%20Truly%20Drive%20AI%20On-Chain%20at%20Scale?)\n\n## **Background**\n\nThe AI sector has been on a meteoric rise, catalyzed by large language models like **ChatGPT** and **ERNIE Bot**. Yet AI is more than just chatbots and generative text; it also includes everything from AlphaGo’s Go victories to image generation tools like MidJourney. The holy grail that many developers pursue is a general-purpose AI, or **AGI** (Artificial General Intelligence)—colloquially described as an AI “Agent” capable of learning, perception, decision-making, and complex execution similar to human intelligence.\n\nHowever, both AI and AI Agent applications are extremely **data-intensive**. They rely on massive datasets for training and inference. Traditionally, this data is stored and processed on centralized infrastructure. With the advent of blockchain, a new approach known as **DeAI (Decentralized AI)** has emerged. DeAI attempts to leverage decentralized networks for data storage, sharing, and verification to overcome the pitfalls of traditional, centralized AI solutions.\n\n**0G Labs** stands out in this DeAI infrastructure landscape, aiming to build a **decentralized AI operating system** known simply as **0G**.\n\n![](https://tp-misc.b-cdn.net/blockeden/2024-12-15-0g-labs-1.webp)\n\n## **What Is 0G Labs?**\n\nIn traditional computing, an **Operating System (OS)** manages hardware and software resources—think Microsoft Windows, Linux, macOS, iOS, or Android. An OS abstracts away the complexity of the underlying hardware, making it easier for both end-users and developers to interact with the computer.\n\nBy analogy, the **0G OS** aspires to fulfill a similar role in Web3:\n- **Manage** decentralized storage, compute, and data availability.\n- **Simplify** on-chain AI application deployment.\n\n**Why decentralization?** Conventional AI systems store and process data in centralized silos, raising concerns around data transparency, user privacy, and fair compensation for data providers. 0G’s approach uses decentralized storage, cryptographic proofs, and open incentive models to mitigate these risks.\n\nThe name **“0G”** stands for **“Zero Gravity.”** The team envisions an environment where data exchange and computation feel “weightless”—everything from AI training to inference and data availability happens seamlessly on-chain.\n\nThe **0G Foundation**, formally established in October 2024, drives this initiative. Its stated mission is to make AI a public good—one that is accessible, verifiable, and open to all.\n\n![](https://tp-misc.b-cdn.net/blockeden/2024-12-15-0g-labs-2.webp)\n\n## **Key Components of the 0G Operating System**\n\nFundamentally, **0G** is a modular architecture designed specifically to support AI applications on-chain. Its **three primary pillars** are:\n\n1. **0G Storage** – A decentralized storage network.\n2. **0G DA (Data Availability)** – A specialized data availability layer ensuring data integrity.\n3. **0G Compute Network** – Decentralized compute resource management and settlement for AI inference (and eventually training).\n\nThese pillars work in concert under the umbrella of a **Layer1 network called 0G Chain**, which is responsible for consensus and settlement.\n\nAccording to the **0G Whitepaper** (“0G: Towards Data Availability 2.0”), both the 0G Storage and 0G DA layers build on top of 0G Chain. Developers can launch multiple custom **PoS consensus networks**, each functioning as part of the 0G DA and 0G Storage framework. This modular approach means that as system load grows, 0G can dynamically add new validator sets or specialized nodes to scale out.\n\n### **0G Storage**\n\n**0G Storage** is a decentralized storage system geared for large-scale data. It uses distributed nodes with built-in incentives for storing user data. Crucially, it splits data into **smaller, redundant “chunks”** using **Erasure Coding (EC)**, distributing these chunks across different storage nodes. If a node fails, data can still be reconstructed from redundant chunks.\n\n#### **Supported Data Types**\n\n0G Storage accommodates both **structured** and **unstructured** data.\n\n1. **Structured Data** is stored in a **Key-Value (KV) layer**, suitable for dynamic and frequently updated information (think databases, collaborative documents, etc.).\n2. **Unstructured Data** is stored in a **Log layer** which appends data entries chronologically. This layer is akin to a file system optimized for large-scale, append-only workloads.\n\nBy stacking a KV layer on top of the Log layer, 0G Storage can serve diverse AI application needs—from storing large model weights (unstructured) to dynamic user-based data or real-time metrics (structured).\n\n#### **PoRA Consensus**\n\n**PoRA** (Proof of Random Access) ensures storage nodes actually hold the chunks they claim to store. Here’s how it works:\n\n- Storage miners are periodically **challenged** to produce cryptographic hashes of specific random data chunks they store.\n- They must respond by generating a valid hash (similar to PoW-like puzzle-solving) derived from their local copy of the data.\n\nTo level the playing field, the system limits mining competitions to 8 TB segments. A large miner can subdivide its hardware into multiple 8 TB partitions, while smaller miners compete within a single 8 TB boundary.\n\n![](https://tp-misc.b-cdn.net/blockeden/2024-12-15-0g-labs-3.webp)\n\n#### **Incentive Design**\n\nData in **0G Storage** is divided into 8 GB “Pricing Segments.” Each segment has both a **donation pool** and a **reward pool**. Users who wish to store data pay a fee in **0G Token (ZG)**, which partially funds node rewards.\n\n- **Base Reward:** When a storage node submits valid PoRA proofs, it gets immediate block rewards for that segment.\n- **Ongoing Reward:** Over time, the donation pool releases a portion (currently ~4% per year) into the reward pool, incentivizing nodes to store data **permanently**. The fewer the nodes storing a particular segment, the larger the share each node can earn.\n\nUsers only pay **once** for permanent storage, but must set a donation fee above a system minimum. The higher the donation, the more likely miners are to replicate the user’s data.\n\n**Royalty Mechanism:** 0G Storage also includes a “royalty” or “data sharing” mechanism. Early storage providers create “royalty records” for each data chunk. If new nodes want to store that same chunk, the original node can share it. When the new node later proves storage (via PoRA), the original data provider receives an ongoing royalty. The more widely replicated the data, the higher the aggregate reward for early providers.\n\n#### **Comparisons with Filecoin and Arweave**\n\n**Similarities:**\n- All three incentivize decentralized data storage.\n- Both 0G Storage and Arweave aim for **permanent** storage.\n- Data chunking and redundancy are standard approaches.\n\n**Key Differences:**\n- **Native Integration:** 0G Storage is not an independent blockchain; it’s integrated directly with **0G Chain** and primarily supports AI-centric use cases.\n- **Structured Data:** 0G supports KV-based structured data alongside unstructured data, which is critical for many AI workloads requiring frequent read-write access.\n- **Cost:** 0G claims **$10–11/TB** for permanent storage, reportedly cheaper than Arweave.\n- **Performance Focus:** Specifically designed to meet AI throughput demands, whereas Filecoin or Arweave are more general-purpose decentralized storage networks.\n\n### **0G DA (Data Availability Layer)**\n\n**Data availability** ensures that every network participant can fully verify and retrieve transaction data. If the data is incomplete or withheld, the blockchain’s trust assumptions break.\n\nIn the 0G system, data is chunked and stored off-chain. The system records Merkle roots for these data chunks, and DA nodes must **sample** these chunks to ensure they match the Merkle root and erasure-coding commitments. Only then is the data deemed “available” and appended into the chain’s consensus state.\n\n#### **DA Node Selection and Incentives**\n\n- DA nodes must **stake** ZG to participate.\n- They’re grouped into **quorums** randomly via Verifiable Random Functions (VRFs).\n- Each node only validates a **subset** of data. If **2/3** of a quorum confirm the data as available and correct, they sign a proof that’s aggregated and submitted to the 0G consensus network.\n- Reward distribution also happens through periodic sampling. Only the nodes storing randomly sampled chunks are eligible for that round’s rewards.\n\n#### **Comparison with Celestia and EigenLayer**\n\n0G DA draws on ideas from **Celestia** (data availability sampling) and **EigenLayer** (restaking) but aims to provide **higher throughput**. Celestia’s throughput currently hovers around **10 MB/s** with ~12-second block times. Meanwhile, **EigenDA** primarily serves Layer2 solutions and can be complex to implement. 0G envisions **GB/s** throughput, which better suits large-scale AI workloads that can exceed 50–100 GB/s of data ingestion.\n\n### **0G Compute Network**\n\n**0G Compute Network** serves as the decentralized computing layer. It’s evolving in phases:\n\n- **Phase 1:** Focus on settlement for AI inference.\n- The network matches “AI model buyers” (users) with compute providers (sellers) in a decentralized marketplace. Providers register their services and prices in a smart contract. Users pre-fund the contract, consume the service, and the contract mediates payment.\n- Over time, the team hopes to expand to full-blown **AI training** on-chain, though that’s more complex.\n\n**Batch Processing:** Providers can batch user requests to reduce on-chain overhead, improving efficiency and lowering costs.\n\n### **0G Chain**\n\n**0G Chain** is a **Layer1** network serving as the foundation for 0G’s modular architecture. It underpins:\n\n- **0G Storage** (via smart contracts)\n- **0G DA** (data availability proofs)\n- **0G Compute** (settlement mechanisms)\n\nPer official docs, **0G Chain** is **EVM-compatible**, enabling easy integration for dApps that require advanced data storage, availability, or compute.\n\n#### **0G Consensus Network**\n\n0G’s consensus mechanism is somewhat unique. Rather than a single monolithic consensus layer, **multiple independent consensus networks** can be launched under 0G to handle different workloads. These networks share the same staking base:\n\n- **Shared Staking:** Validators stake ZG on Ethereum. If a validator misbehaves, their staked ZG on Ethereum can be slashed.\n- **Scalability:** New consensus networks can be spun up to scale horizontally.\n\n**Reward Mechanism:**\nWhen validators finalize blocks in the 0G environment, they receive tokens. However, the tokens they earn on 0G Chain are **burned** in the local environment, and the validator’s Ethereum-based account is **minted** an equivalent amount, ensuring a single point of liquidity and security.\n\n![](https://tp-misc.b-cdn.net/blockeden/2024-12-15-0g-labs-4.webp)\n\n#### **0G Token (ZG)**\n\n**ZG** is an **ERC-20 token** representing the backbone of 0G’s economy. It’s minted, burned, and circulated via **smart contracts** on Ethereum. In practical terms:\n\n- Users pay for storage, data availability, and compute resources in **ZG**.\n- Miners and validators earn ZG for proving storage or validating data.\n- Shared staking ties the security model back to Ethereum.\n\n### **Summary of Key Modules**\n\n**0G OS** merges four components—Storage, DA, Compute, and Chain—into one interconnected, modular stack. The system’s design goal is **scalability**, with each layer horizontally extensible. The team touts the potential for **“infinite” throughput**, especially crucial for large-scale AI tasks.\n\n## **0G Ecosystem**\n\n![](https://tp-misc.b-cdn.net/blockeden/2024-12-15-0g-labs-5.webp)\n\nAlthough relatively new, the **0G ecosystem** already includes key integration partners:\n\n1. **Infrastructure & Tooling:**\n   - **ZK** solutions like Union, Brevis, Gevulot\n   - **Cross-chain** solutions like Axelar\n   - **Restaking** protocols like EigenLayer, Babylon, PingPong\n   - **Decentralized GPU** providers IoNet, exaBits\n   - **Oracle** solutions Hemera, Redstone\n   - **Indexing** tools for Ethereum blob data\n\n2. **Projects Using 0G for Data Storage & DA:**\n   - **Polygon, Optimism (OP), Arbitrum, Manta** for L2 / L3 integration\n   - **Nodekit, AltLayer** for Web3 infrastructure\n   - **Blade Games, Shrapnel** for on-chain gaming\n\n### **Supply Side**\n\n**ZK** and **Cross-chain** frameworks connect 0G to external networks. Restaking solutions (e.g., EigenLayer, Babylon) strengthen security and possibly attract liquidity. GPU networks accelerate erasure coding. Oracle solutions feed off-chain data or reference AI model pricing.\n\n### **Demand Side**\n\n**AI Agents** can tap 0G for both data storage and inference. **L2s and L3s** can integrate 0G’s DA to improve throughput. **Gaming** and other dApps requiring robust data solutions can store assets, logs, or scoring systems on 0G. Some have already partnered with the project, pointing to early ecosystem traction.\n\n## **Roadmap & Risk Factors**\n\n**0G** aims to make AI a **public utility**, accessible and verifiable by anyone. The team aspires to GB/s-level DA throughput—crucial for real-time AI training that can demand 50–100 GB/s of data transfer.\n\nCo-founder & CEO **Michael Heinrich** has stated that the explosive growth of AI makes timely iteration critical. The pace of AI innovation is fast; 0G’s own dev progress must keep up.\n\n**Potential Trade-Offs:**\n\n- Current reliance on **shared staking** might be an intermediate solution. Eventually, 0G plans to introduce a horizontally scalable consensus layer that can be incrementally augmented (akin to spinning up new AWS nodes).\n- **Market Competition:** Many specialized solutions exist for decentralized storage, data availability, and compute. 0G’s all-in-one approach must stay compelling.\n- **Adoption & Ecosystem Growth:** Without robust developer traction, the promised “unlimited throughput” remains theoretical.\n- **Sustainability of Incentives:** Ongoing motivation for nodes depends on real user demand and an equilibrium token economy.\n\n## **Conclusion**\n\n**0G** attempts to unify decentralized storage, data availability, and compute into a single “operating system” supporting on-chain AI. By targeting **GB/s** throughput, the team seeks to break the performance barrier that currently deters large-scale AI from migrating on-chain. If successful, **0G** could significantly accelerate the Web3 AI wave by providing a *scalable, integrated, and developer-friendly* infrastructure.\n\nStill, many open questions remain. The viability of “infinite throughput” hinges on whether 0G’s modular consensus and incentive structures can seamlessly scale. External factors—market demand, node uptime, developer adoption—will also determine 0G’s staying power. Nonetheless, 0G’s approach to addressing AI’s data bottlenecks is novel and ambitious, hinting at a promising new paradigm for on-chain AI."
  },
  {
    "id": "/2024/12/12/radiant-capital-hack",
    "metadata": {
      "permalink": "/blog/2024/12/12/radiant-capital-hack",
      "source": "@site/blog/2024-12-12-radiant-capital-hack.md",
      "title": "The Radiant Capital Hack: How North Korean Hackers Used a Single PDF to Steal Hundreds of Millions",
      "description": "In a sophisticated cyber attack, North Korean hackers exploited social engineering tactics to steal $50 million from Radiant Capital. This incident highlights critical vulnerabilities in crypto security and the need for enhanced protective measures.",
      "date": "2024-12-12T00:00:00.000Z",
      "formattedDate": "December 12, 2024",
      "tags": [
        {
          "label": "Cybersecurity",
          "permalink": "/blog/tags/cybersecurity"
        },
        {
          "label": "DeFi",
          "permalink": "/blog/tags/de-fi"
        },
        {
          "label": "North Korea",
          "permalink": "/blog/tags/north-korea"
        },
        {
          "label": "Hacking",
          "permalink": "/blog/tags/hacking"
        },
        {
          "label": "Crypto",
          "permalink": "/blog/tags/crypto"
        }
      ],
      "readingTime": 3,
      "hasTruncateMarker": false,
      "authors": [],
      "frontMatter": {
        "title": "The Radiant Capital Hack: How North Korean Hackers Used a Single PDF to Steal Hundreds of Millions",
        "tags": [
          "Cybersecurity",
          "DeFi",
          "North Korea",
          "Hacking",
          "Crypto"
        ],
        "keywords": [
          "Radiant Capital",
          "cyber attack",
          "North Korean hackers",
          "DeFi security",
          "social engineering"
        ],
        "description": "In a sophisticated cyber attack, North Korean hackers exploited social engineering tactics to steal $50 million from Radiant Capital. This incident highlights critical vulnerabilities in crypto security and the need for enhanced protective measures.",
        "image": "https://tp-misc.b-cdn.net/blockeden/2024-12-12-radiant-capital-hack.webp"
      },
      "unlisted": false,
      "prevItem": {
        "title": "Can 0G’s Decentralized AI Operating System Truly Drive AI On-Chain at Scale?",
        "permalink": "/blog/2024/12/15/0g-labs"
      },
      "nextItem": {
        "title": "TEE and Blockchain Privacy: A $3.8B Market at the Crossroads of Hardware and Trust",
        "permalink": "/blog/2024-12-06-tee"
      }
    },
    "content": "In one of the most sophisticated cyber attacks of 2023, Radiant Capital, a decentralized cross-chain lending protocol built on LayerZero, lost approximately $50 million to hackers. The complexity and precision of this attack revealed the advanced capabilities of state-sponsored North Korean hackers, pushing the boundaries of what many thought possible in crypto security breaches.\n\n![The Radiant Capital Hack: How North Korean Hackers Used a Single PDF to Steal Hundreds of Millions](https://tp-misc.b-cdn.net/blockeden/2024-12-12-radiant-capital-hack.webp \"The Radiant Capital Hack: How North Korean Hackers Used a Single PDF to Steal Hundreds of Millions\")\n\n## The Perfect Social Engineering Attack\n\nOn September 11, 2023, a Radiant Capital developer received what seemed like an innocent Telegram message. The sender posed as a former contractor, claiming they had switched careers to smart contract auditing and wanted feedback on a project report. This type of request is commonplace in the remote-work culture of crypto development, making it particularly effective as a social engineering tactic.\n\nThe attackers went the extra mile by creating a fake website that closely mimicked the supposed contractor's legitimate domain, adding another layer of authenticity to their deception.\n\n## The Trojan Horse\n\nWhen the developer downloaded and unzipped the file, it appeared to be a standard PDF document. However, the file was actually a malicious executable called INLETDRIFT disguised with a PDF icon. Once opened, it silently installed a backdoor on the macOS system and established communication with the attackers' command server (atokyonews[.]com).\n\nThe situation worsened when the infected developer, seeking feedback, shared the malicious file with other team members, inadvertently spreading the malware within the organization.\n\n## The Sophisticated Man-in-the-Middle Attack\n\nWith the malware in place, the hackers executed a precisely targeted \"bait-and-switch\" attack. They intercepted transaction data when team members were operating their Gnosis Safe multi-signature wallet. While the transaction appeared normal on the web interface, the malware replaced the transaction content when it reached the Ledger hardware wallet for signing.\n\nDue to the blind signing mechanism used in Safe multi-sig transactions, team members couldn't detect that they were actually signing a transferOwnership() function call, which handed control of the lending pools to the attackers. This allowed the hackers to drain user funds that had been authorized to the protocol's contracts.\n\n## The Swift Cleanup\n\nFollowing the theft, the attackers demonstrated remarkable operational security. Within just three minutes, they removed all traces of the backdoor and browser extensions, effectively covering their tracks.\n\n## Key Lessons for the Industry\n\n1. **Never Trust File Downloads**: Teams should standardize on online document tools like Google Docs or Notion instead of downloading files. For example, OneKey's recruitment process only accepts Google Docs links, explicitly refusing to open any other files or links.\n\n2. **Frontend Security is Critical**: The incident highlights how easily attackers can spoof transaction information on the frontend, making users unknowingly sign malicious transactions.\n\n3. **Blind Signing Risks**: Hardware wallets often display oversimplified transaction summaries, making it difficult to verify the true nature of complex smart contract interactions.\n\n4. **DeFi Protocol Safety**: Projects handling large amounts of capital should implement timelock mechanisms and robust governance processes. This creates a buffer period for detecting and responding to suspicious activities before funds can be moved.\n\nThe Radiant Capital hack serves as a sobering reminder that even with hardware wallets, transaction simulation tools, and industry best practices, sophisticated attackers can still find ways to compromise security. It underscores the need for constant vigilance and evolution in crypto security measures.\n\nAs the industry matures, we must learn from these incidents to build more robust security frameworks that can withstand increasingly sophisticated attack vectors. The future of DeFi depends on it."
  }
]