[
  {
    "id": "/2024/07/18/iotex-2-0-depin-for-everyone",
    "metadata": {
      "permalink": "/blog/2024/07/18/iotex-2-0-depin-for-everyone",
      "source": "@site/blog/2024-07-18-iotex-2-0-depin-for-everyone.md",
      "title": "IoTeX 2.0: Empowering DePIN for Everyone",
      "description": "Discover how IoTeX 2.0 is revolutionizing the DePIN landscape with innovative modular infrastructure, comprehensive tokenomics, and public goods, making decentralized physical infrastructure networks accessible to everyone.",
      "date": "2024-07-18T00:00:00.000Z",
      "formattedDate": "July 18, 2024",
      "tags": [
        {
          "label": "iotex",
          "permalink": "/blog/tags/iotex"
        }
      ],
      "readingTime": 3.175,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "IoTeX 2.0: Empowering DePIN for Everyone",
        "authors": [
          "dora"
        ],
        "tags": [
          "iotex"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/iotex-2-0-depin-for-everyone.webp",
        "description": "Discover how IoTeX 2.0 is revolutionizing the DePIN landscape with innovative modular infrastructure, comprehensive tokenomics, and public goods, making decentralized physical infrastructure networks accessible to everyone."
      },
      "unlisted": false,
      "nextItem": {
        "title": "Announcing the Winners of the Sui Overflow Hackathon!",
        "permalink": "/blog/2024/07/09/sui-overflow-hackathon-winner"
      }
    },
    "content": "Decentralized physical infrastructure network (DePIN) is emerging as a transformative force in the Web3 landscape, offering a new paradigm for building, operating, and managing physical infrastructure networks. However, many DePIN startups face significant challenges due to a lack of funds and technical competence. IoTeX 2.0 aims to address these challenges with a suite of innovations designed to support the DePIN community in realizing the vision of \"DePIN for Everyone!\".\n\n\n![](https://tp-misc.b-cdn.net/blockeden/iotex-2-0-depin-for-everyone.webp)\n\n\n## Core Innovations of IoTeX 2.0\n\n1. **Tokenomic Design**:\n   - A comprehensive utility for IOTX tokens within the modular DePIN infrastructure.\n   - Inflationary staking rewards, deflationary burning mechanisms, and growth incentives to maintain a balanced token supply.\n\n2. **Modular DePIN Infrastructure**:\n   - **Modular Security Pool (MSP)**: Provides a unified trusted layer for DePIN infrastructure modules through restaking.\n   - **W3bstream**: A decentralized multi-prover network for DePIN verification, supporting various validity proof approaches.\n   - **ioID**: A unified identity system managing and securing machine-to-machine and machine-to-person relationships.\n   - **ioConnect**: A universal embedded SDK empowering device abstraction and facilitating smart device interaction.\n   - **ioDDK**: A chain SDK allowing DePIN projects to provision self-sovereign application chains, inheriting IoTeX L1 security.\n\n3. **Public Goods**:\n   - Tools like DePINScan and DePIN Liquidity Hub to support awareness, usability, and liquidity for DePIN projects.\n\n## The Importance of DePIN\n\nDePIN aims to disrupt traditional industries and public utilities, which are often monopolies controlled by centralized corporations and governments. By leveraging blockchain technology, DePIN can bring transparency, trust, and innovation to physical infrastructure and public utilities. This new model allows people to contribute to and build equity in real-world infrastructure networks, overcoming financial and logistical barriers to entry.\n\n## The DePIN Landscape\n\nDePIN is a collective effort of numerous projects across the globe, focusing on decentralizing and improving physical infrastructure. The DePIN sector includes:\n- **Physical Resource Networks**: Produce non-fungible resources relying on location-dependent hardware.\n- **Digital Resource Networks**: Produce marketplaces for fungible resources, relying on location-agnostic hardware.\n- **Infrastructure and Tooling**: Facilitate growth and provide off-the-shelf capabilities for DePIN applications.\n\n## The DePIN Tech Stack and Its Challenges\n\nThe DePIN tech stack requires an end-to-end architecture connecting the real world to the blockchain. This includes layers like hardware abstraction, connectivity, sequencer, data availability, long-term storage, off-chain computing, blockchain, identity, and governance. Developing this complex stack presents high barriers to entry, particularly for emerging markets.\n\n## IoTeX 2.0: A Modular Approach\n\nIoTeX 2.0 introduces a modular infrastructure, allowing DePIN projects to construct a tech stack that suits their specific needs. This approach supports both large and small teams by providing comprehensive and purpose-built solutions. Key components include:\n\n- **Modular Security Pool (MSP)**: Ensures unified and end-to-end trust across DIMs, leveraging staked assets from well-established blockchains.\n- **W3bstream**: Facilitates decentralized off-chain computing with multiple provers, enhancing the scalability and efficiency of DePIN applications.\n- **ioID and ioConnect**: Simplify identity management and hardware abstraction, respectively, enabling seamless integration of smart devices into DePIN projects.\n- **ioDDK**: Supports the launch of self-sovereign L2 blockchains, expanding the capabilities of DePIN projects.\n\n## Future Outlook\n\nIoTeX 2.0 aims to create a new world where physical infrastructure networks are decentralized, transparent, and equitable. By leveraging cutting-edge technologies like zero-knowledge proofs, AI, and blockchain, IoTeX 2.0 envisions a future where smart devices, autonomous systems, and digital resource marketplaces operate seamlessly and securely. This vision empowers everyday people to contribute to and benefit from the modernization of global infrastructure, ensuring \"DePIN for Everyone!\".\n\n### Summary\n\nIoTeX 2.0 is a significant milestone in the evolution of the IoTeX network, addressing the challenges faced by DePIN startups and driving the next phase of growth for decentralized physical infrastructure networks. With its innovative modular infrastructure, comprehensive tokenomics, and commitment to public goods, IoTeX 2.0 is poised to lead the DePIN movement and empower builders worldwide. Are you an IoTeX developer? BlockEden.xyz offers IoTeX RPC at https://blockeden.xyz/api-marketplace/iotex."
  },
  {
    "id": "/2024/07/09/sui-overflow-hackathon-winner",
    "metadata": {
      "permalink": "/blog/2024/07/09/sui-overflow-hackathon-winner",
      "source": "@site/blog/2024-07-09-sui-overflow-hackathon-winner.md",
      "title": "Announcing the Winners of the Sui Overflow Hackathon!",
      "description": "BlockEden.xyz is thrilled to announce the winners of the Sui Overflow Hackathon! After weeks of innovative coding, intense competition, and creative problem-solving, we are proud to present the projects that stood out the most. Congratulations to all the participants for their outstanding contributions. Here are the top winners.",
      "date": "2024-07-09T00:00:00.000Z",
      "formattedDate": "July 9, 2024",
      "tags": [
        {
          "label": "Sui",
          "permalink": "/blog/tags/sui"
        }
      ],
      "readingTime": 2.845,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Announcing the Winners of the Sui Overflow Hackathon!",
        "authors": [
          "dora"
        ],
        "tags": [
          "Sui"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/2024-07-09-sui-overflow-hackathon-winner.webp",
        "description": "BlockEden.xyz is thrilled to announce the winners of the Sui Overflow Hackathon! After weeks of innovative coding, intense competition, and creative problem-solving, we are proud to present the projects that stood out the most. Congratulations to all the participants for their outstanding contributions. Here are the top winners."
      },
      "unlisted": false,
      "prevItem": {
        "title": "IoTeX 2.0: Empowering DePIN for Everyone",
        "permalink": "/blog/2024/07/18/iotex-2-0-depin-for-everyone"
      },
      "nextItem": {
        "title": "Understanding TON: Revolutionizing Blockchain and Formidable Ecosystem",
        "permalink": "/blog/2024/07/08/ton"
      }
    },
    "content": "BlockEden.xyz is thrilled to announce the winners of the Sui Overflow Hackathon! After weeks of innovative coding, intense competition, and creative problem-solving, we are proud to present the projects that stood out the most. Congratulations to all the participants for their outstanding contributions. Here are the top winners:\n\n![](https://tp-misc.b-cdn.net/blockeden/2024-07-09-sui-overflow-hackathon-winner.webp)\n\n## 1st Prize ($1,500 in SUI): Orbital\n**Project Links:**\n- [GitHub Repository](https://github.com/devarogundade/orbital/)\n- [Website](https://myorbital.xyz/)\n\nOrbital is a cutting-edge cross-chain lending platform that leverages wormhole technology and Supra Oracles to revolutionize decentralized finance (DeFi). By enabling seamless and secure lending and borrowing across multiple blockchain networks like SUI and Avalanche, Orbital maximizes liquidity and capital efficiency. The integration of Supra Oracles ensures accurate, real-time data for price feeds and interest rates.\n\nDesigned to feel like a DEX that many blockchain users are accustomed to, Orbital simplifies the user experience with a unified interface where users can manage all transactions from a single dashboard. This intuitive design makes it just one-click to borrow, transforming the traditional DeFi landscape.\n\n## 2nd Prize ($1,000 in SUI): Liquidity Garden\n**Project Link:**\n- [Website](https://liquidity-garden.vercel.app/)\n\nLiquidity Garden is an innovative farm simulation game where players build and manage their own farm garden. Players stake liquidity from FlowX DEX to buy NFT seeds, water them daily, and watch as dynamic NFTs grow and release $OXYGEN tokens. With additional features like raising pets and integrating token swaps directly in the game, Liquidity Garden provides a unique blend of gaming and DeFi, encouraging continuous engagement and interaction.\n\n## 3rd Prize ($100 in SUI): BioWallet, Cocktail OTC Market, SharkyTheSuiBot, Zomdev\n\n### BioWallet\n**Project Links:**\n- [GitHub Repository](https://github.com/Nilay27/BioWallet)\n- [Website](https://biowallet.my.canva.site/)\n\nBioWallet transforms devices into secure hardware wallets by leveraging biometric-based onboarding. This innovative digital wallet eliminates the need for traditional seed phrases, storing private keys securely in the Secure Enclave. With advanced features like MultiSig and WebAuthn, BioWallet offers top-notch protection and flexibility, bridging the gap between traditional browser wallets and hardware wallets.\n\n### Cocktail OTC Market\n**Project Links:**\n- [GitHub Repository](https://github.com/0xtail-hackathon/sui-overflow-2024)\n- [Website](https://0xtail-hackathon.github.io/sui-overflow-2024/)\n\nCocktail OTC Market provides a seamless platform for token transactions without the need for a centralized exchange. Sellers can list their tokens with flexible pricing, and buyers can browse and purchase tokens easily. Managed by Sui contracts, Cocktail OTC Market ensures secure and transparent transactions, making it a reliable solution for token trading.\n\n### SharkyTheSuiBot\n**Project Links:**\n- [GitHub Repository](https://github.com/CryptoInnovators/sharkythesuibot)\n- [Telegram](https://t.me/sharkythesuibot)\n\nSharkyTheSuiBot is the fastest SUI Telegram bot designed to find and exploit arbitrage opportunities across different SUI DEXs. It performs trading activities based on script-logic strategies, offers real-time price fetching, and enables users to provide liquidity in pools directly from the bot. With advanced features like flash loans and real-time charts, SharkyTheSuiBot enhances the user trading experience.\n\n### Zomdev\n**Project Links:**\n- [GitHub Repository](https://github.com/RevanthGundala/zomdev)\n- [Website](https://zomdev.com)\n\nZomdev is a developer bounty system where companies post bounties for GitHub issues or talent acquisition, and developers can claim these bounties based on project submissions. This platform facilitates a dynamic interaction between companies seeking development assistance and developers looking for opportunities to earn and showcase their skills.\n\n## Final Words\n\nCongratulations to all the winners and participants! Your innovative solutions and creative ideas have made this hackathon a remarkable success. We look forward to seeing how these projects evolve and continue to impact the blockchain and DeFi landscape.\n\nStay tuned for more updates and future hackathons from BlockEden.xyz!\n\n------\n\n- Twitter: [https://twitter.com/BlockEdenHQ](https://twitter.com/BlockEdenHQ)\n- Discord: [https://discord.gg/4Yfvs2HWey](https://discord.gg/4Yfvs2HWey)\n- Source Link: https://blockeden.xyz/blog/2024/07/09/sui-overflow-hackathon-winner/"
  },
  {
    "id": "/2024/07/08/ton",
    "metadata": {
      "permalink": "/blog/2024/07/08/ton",
      "source": "@site/blog/2024-07-08-ton.md",
      "title": "Understanding TON: Revolutionizing Blockchain and Formidable Ecosystem",
      "description": "Telegram, a popular cross-platform IM tool, created by Pavel Durov, launched TON (Telegram Open Network) in 2013. With 1.8 billion users and 70 billion daily messages, TON has raised $850 million through ICO for its development. This blog delves into TON’s unique technical features and services.",
      "date": "2024-07-08T00:00:00.000Z",
      "formattedDate": "July 8, 2024",
      "tags": [
        {
          "label": "ton",
          "permalink": "/blog/tags/ton"
        }
      ],
      "readingTime": 4.065,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Understanding TON: Revolutionizing Blockchain and Formidable Ecosystem",
        "authors": [
          "dora"
        ],
        "tags": [
          "ton"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/2024-07-08-ton.webp",
        "description": "Telegram, a popular cross-platform IM tool, created by Pavel Durov, launched TON (Telegram Open Network) in 2013. With 1.8 billion users and 70 billion daily messages, TON has raised $850 million through ICO for its development. This blog delves into TON’s unique technical features and services."
      },
      "unlisted": false,
      "prevItem": {
        "title": "Announcing the Winners of the Sui Overflow Hackathon!",
        "permalink": "/blog/2024/07/09/sui-overflow-hackathon-winner"
      },
      "nextItem": {
        "title": "Decentralized AI: Permissionless LLM Inference on BlockEden.xyz",
        "permalink": "/blog/2024/06/20/decentralized-inference-blockeden-xyz"
      }
    },
    "content": "Telegram, a popular cross-platform IM tool, created by Pavel Durov, launched TON (Telegram Open Network) in 2013. With 1.8 billion users and 70 billion daily messages, TON has raised $850 million through ICO for its development. This blog delves into TON’s unique technical features and services.\n\n![](https://tp-misc.b-cdn.net/blockeden/2024-07-08-ton.webp)\n\n## Chain Specs\n\nTON (Telegram Open Network), as outlined in its whitepaper, classifies all public blockchains along five dimensions:\n\n- Single-chain vs. multi-chain\n- Smart contract support\n- Consensus mechanism\n- Sharding support\n- Chain interconnectivity\n\n### Multi-Chain Blockchain System\n\nTON is not a single-chain blockchain but a collection of multiple blockchains, including Masterchain, Workchains, and Shardchains.\n\n- **Masterchain**: The core of TON’s blockchain system, storing essential information and parameters. It records validators, their token holdings, active Workchains, and Shardchains. The Masterchain contains the latest block hashes of all Workchains and Shardchains, ensuring overall coordination and security.\n- **Workchains**: Up to 2^32 Workchains can exist, each handling fund transfers and smart contract interactions. Workchains can have different rules, such as account address formats, transaction formats, smart contract types, and virtual machines. Despite their differences, they must adhere to interoperability standards to enable smooth interaction.\n- **Shardchains**: These are subdivisions of Workchains, designed to improve processing efficiency by distributing tasks among multiple Shardchains. Shardchains follow the rules of their respective Workchains and automatically split or merge based on load, ensuring scalability and performance optimization.\n\n### TON Virtual Machine (TVM)\n\nTVM is a program execution environment running on the blockchain, primarily for executing smart contracts. In TVM, everything is built out of cells and there is TVM that is instantiated for each contract every time.\n\n- **Data Storage**: TVM stores data in cells, each containing up to 128 bytes and references to other cells. This structure allows flexible data handling.\n- **Data Handling**: TVM can manage various data types, using a stack-based structure for efficient computation.\n- **Built-in Functions**: TVM includes tools like hash tables, encryption (elliptic curves), hash functions (e.g., SHA256), and Merkle proof mechanisms, ensuring data security and integrity.\n- **Large Smart Contract Support**: TVM can handle complex and large smart contracts, accommodating dynamic sharding.\n- **Programming Languages**: TVM supports FunC, Fift, and Tact, each tailored for different needs.\n- **Additional Features**: TVM supports closures and efficiently executes complex tasks.\n\n### Infinite Dynamic Sharding\n\nUnlike traditional top-down sharding, TON employs a bottom-up approach. It envisions extreme sharding, where each shard is an account chain. These account chains form larger Shardchains, which connect to the Masterchain, creating a scalable and flexible system.\n\nTON’s dynamic sharding adjusts shard numbers based on load. If a shard’s load is high, it splits; if low, it merges. This dynamic adjustment ensures load balancing, performance optimization, and resource utilization.\n\n### BFT PoS Consensus Mechanism\n\nTON uses a BFT PoS consensus mechanism, combining Byzantine Fault Tolerance (BFT) and Proof of Stake (PoS).\n\n- **BFT**: An algorithm handling Byzantine faults, ensuring system consistency despite up to one-third of nodes failing.\n- **PoS**: Nodes with more tokens have a higher chance of validating transactions and generating blocks, incentivizing security.\n\n**Roles in TON’s PoS Mechanism**:\n\n- **Validators**: Nodes maintaining network security and validating transactions by staking 300,000 TON tokens.\n- **Nominators**: Entities providing stake to validators, sharing in the rewards if the validator performs well.\n\n### Tight-Coupling Chain Interactivity\n\nTON’s tightly-coupled system ensures fast message passing and consistency across all blockchains. Features like embedding Shardchain block hashes in Masterchain blocks and using vertical blockchains for error correction help achieve this.\n\n**Vertical Blockchain Mechanism**: When an invalid block is detected, a corrected block is added vertically, preserving valid parts and reducing disruption.\n\n**Hypercube Routing**: Messages traverse a hypercube network, ensuring accurate and swift delivery across Shardchains.\n\n## TON Services\n\n**TON DNS**: Provides name mapping for blockchain accounts, smart contracts, and services, making DApp usage as convenient as traditional internet domains.\n\n**TON Proxy**: An anonymous network proxy service that hides TON node IP addresses, similar to I2P, creating a decentralized VPN service.\n\n**TON Storage**: A distributed storage system akin to IPFS, using P2P networks for file storage. It supports complex DApp storage needs, such as video streaming.\n\n**TON Pay**: Integrated micropayment channels for instant off-chain transactions, ensuring secure and efficient payments for all DApps on TON.\n\n## Token Economy\n\nTON’s token, Gram, has a total supply of 5 billion, with a portion mined and a fraction allocated to reward DApp developers. A unique pricing mechanism prevents volatility, maintaining economic stability and fostering a sustainable ecosystem.\n\n## Stats\n\n* TVL: $705M\n* Daily Active Wallets: 320K\n* Daily Tx: 4.2M\n\n## Conclusion\n\nTON offers a full-featured blockchain operating system, aiming to surpass platforms like Ethereum and EOS. Its innovative design and comprehensive services make it a formidable player in the blockchain arena. Join the revolution with BlockEden.xyz, where we provide cutting-edge solutions for content creators and developers alike.\n\n\n------\n\n- Twitter: [https://twitter.com/BlockEdenHQ](https://twitter.com/BlockEdenHQ)\n- Discord: [https://discord.gg/4Yfvs2HWey](https://discord.gg/4Yfvs2HWey)\n- Source Link: https://blockeden.xyz/blog/2024/07/08/ton/"
  }
]