[
  {
    "id": "/2023/07/27/blockeden-utilizes-blockchain-measure-compute-unit-credit",
    "metadata": {
      "permalink": "/blog/2023/07/27/blockeden-utilizes-blockchain-measure-compute-unit-credit",
      "source": "@site/blog/2023-07-27-blockeden-utilizes-blockchain-measure-compute-unit-credit.md",
      "title": "BlockEden.xyz Utilizes Blockchain to Measure Compute Unit Credit (CUC)",
      "description": "Get to know how BlockEden.xyz is making strides in the API market through blockchain technology. Our innovative Compute Unit Credit (CUC) is setting a new standard for computational costs, benefitting DApps developers on various platforms.",
      "date": "2023-07-27T00:00:00.000Z",
      "formattedDate": "July 27, 2023",
      "tags": [
        {
          "label": "company",
          "permalink": "/blog/tags/company"
        },
        {
          "label": "product",
          "permalink": "/blog/tags/product"
        }
      ],
      "readingTime": 3.325,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "BlockEden.xyz Utilizes Blockchain to Measure Compute Unit Credit (CUC)",
        "authors": [
          "dora"
        ],
        "tags": [
          "company",
          "product"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/blockeden-utilizes-blockchain-measure-compute-unit-credit.png",
        "description": "Get to know how BlockEden.xyz is making strides in the API market through blockchain technology. Our innovative Compute Unit Credit (CUC) is setting a new standard for computational costs, benefitting DApps developers on various platforms."
      },
      "nextItem": {
        "title": "Unveiling the Integration of OpenAI ChatGPT API in BlockEden.xyz's API Marketplace",
        "permalink": "/blog/2023/07/19/unveiling-integration-openai-api-blockeden-api-marketplace"
      }
    },
    "content": "![](https://tp-misc.b-cdn.net/blockeden/blockeden-utilizes-blockchain-measure-compute-unit-credit.png)\n\n## Introduction\n\nThe rise of web3 has seen a proliferation of decentralized applications (DApps) platforms, all vying for supremacy. Amid this scene enters BlockEden.xyz, a new player with a unique proposition. This web3 native company has now adopted blockchain technology to better measure the computational expense associated with an API invocation, by introducing the Compute Unit Credit (CUC). But how exactly does this work, and what impact will it have on the API market? Let's break it down.\n\n## BlockEden.xyz: Stepping Into The API Market\n\nBlockEden.xyz has made its entry into the API marketplace, providing services across different platforms such as Sui, Aptos, Solana, and 12 EVM blockchains. But there's something that sets this company apart - it's the way they leverage blockchain technology to quantify Compute Unit Credit, paving the way for a more standardized and comparable API cost structure.\n\n### Understanding Compute Unit Credit\n\nThe Compute Unit Credit (CUC) serves as a consistent metric that measures the computational costs tied to an API invocation. This strategy addresses the variations in machine costs for each service, offering a standard way to communicate the price of API invocation and ensuring comparability.\n\nBy applying blockchain technology, BlockEden.xyz has created a secure and transparent system where the cost of API services can be fairly compared, enabling developers to make more informed decisions.\n\n![](https://tp-misc.b-cdn.net/blockeden/cuckoo-network-screenshot.png)\n\n## BlockEden.xyz: Empowered by Blockchain\n\nBlockEden.xyz, as a web3 native company, has fully integrated blockchain technology into its core operations. With the robust security features of blockchain and the principles of decentralization that web3 espouses, the company has established a platform that marries efficiency, security, and transparency.\n\n### A More Transparent API Market\n\nBy using the Compute Unit Credit, BlockEden.xyz aims to build a more transparent and fair API market. Developers can now compare prices easily, and services are priced fairly and transparently.\n\n## FAQs\n\n**1. What is BlockEden.xyz?**\n\nBlockEden.xyz is an API marketplace that provides a variety of services for DApp platforms like Sui, Aptos, Solana, and 12 EVM blockchains.\n\n**2. How does BlockEden.xyz use blockchain technology?**\n\nBlockEden.xyz uses blockchain technology to measure the Compute Unit Credit (CUC), a metric representing the computational expense associated with an API invocation.\n\n**3. What is a Compute Unit Credit (CUC)?**\n\nA Compute Unit Credit (CUC) is a standard measure developed by BlockEden.xyz to calculate the cost of API invocation, enabling fair pricing and easy comparison across different services.\n\n**4. How is BlockEden.xyz a web3 native company?**\n\nBlockEden.xyz is a web3 native company because it uses principles of web3, such as decentralization, while leveraging the security and immutability of blockchain technology.\n\n**5. What is BlockEden.xyz's vision?**\n\nBlockEden.xyz's vision is to create a fair and transparent API market where developers can easily compare API invocation prices, and services are priced using the standard measure - the Compute Unit Credit (CUC).\n\n## Conclusion\n\nAs a new entrant in the API market, BlockEden.xyz is taking a fresh approach by utilizing blockchain technology to measure the Compute Unit Credit (CUC). This innovative measure, coupled with the company's focus on transparency and fair pricing, sets BlockEden.xyz apart and positions it to make a significant impact in the API marketplace. While it's early days yet, it's worth keeping an eye on how this web3 native company will continue to evolve and shape the future of the API market.\n\nThe unveiling of BlockEden.xyz marks the beginning of an exciting journey in the API marketplace. This venture, armed with the Compute Unit Credit and the power of blockchain, is set to redefine how developers interact with API services. To keep yourself updated with their latest advancements and join the conversation with like-minded individuals, don't miss out on connecting with us on our Discord channel at [https://discord.gg/4Yfvs2HWey](https://discord.gg/4Yfvs2HWey). It's not just about being part of a community; it's about staying informed, sharing ideas, and influencing the future of the API market. So, hop on over to our Discord - we can't wait to hear from you!\n\n\n- Twitter: https://twitter.com/BlockEdenHQ\n- Discord: https://discord.gg/4Yfvs2HWey\n- Source Link: https://blockeden.xyz/blog/2023/07/27/blockeden-utilizes-blockchain-measure-compute-unit-credit/"
  },
  {
    "id": "/2023/07/19/unveiling-integration-openai-api-blockeden-api-marketplace",
    "metadata": {
      "permalink": "/blog/2023/07/19/unveiling-integration-openai-api-blockeden-api-marketplace",
      "source": "@site/blog/2023-07-19-unveiling-integration-openai-api-blockeden-api-marketplace.mdx",
      "title": "Unveiling the Integration of OpenAI ChatGPT API in BlockEden.xyz's API Marketplace",
      "description": "We are glad to announce that BlockEden.xyz, web3 developers' go-to platform for API marketplace, has added a new, powerful capability – OpenAI API. Yes, you heard it right! Developers, tech enthusiasts, and AI pioneers can now leverage the cutting-edge machine learning models offered by OpenAI, directly through BlockEden's API Marketplace.",
      "date": "2023-07-19T00:00:00.000Z",
      "formattedDate": "July 19, 2023",
      "tags": [
        {
          "label": "product",
          "permalink": "/blog/tags/product"
        },
        {
          "label": "openai",
          "permalink": "/blog/tags/openai"
        },
        {
          "label": "ai",
          "permalink": "/blog/tags/ai"
        }
      ],
      "readingTime": 3.24,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Unveiling the Integration of OpenAI ChatGPT API in BlockEden.xyz's API Marketplace",
        "authors": [
          "dora"
        ],
        "tags": [
          "product",
          "openai",
          "ai"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/unveiling-integration-openai-api-blockeden-api-marketplace.png"
      },
      "prevItem": {
        "title": "BlockEden.xyz Utilizes Blockchain to Measure Compute Unit Credit (CUC)",
        "permalink": "/blog/2023/07/27/blockeden-utilizes-blockchain-measure-compute-unit-credit"
      },
      "nextItem": {
        "title": "Beyond Boundaries: The Integration of NEAR Protocol into BlockEden.xyz's API Marketplace",
        "permalink": "/blog/2023/07/14/beyond-boundaries-the-integration-of-near-protocol-into-blockedenxyzs-api-marketplace"
      }
    },
    "content": "We are glad to announce that BlockEden.xyz, web3 developers' go-to platform for API marketplace, has added a new, powerful capability – OpenAI API. Yes, you heard it right! Developers, tech enthusiasts, and AI pioneers can now leverage the cutting-edge machine learning models offered by OpenAI, directly through BlockEden's API Marketplace.\n\nBefore we dive into the how-to guide, let's understand what OpenAI API brings to the table. OpenAI API is a gateway to AI models developed by OpenAI, such as the industry-renowned GPT-3, the state-of-the-art transformer-based language model known for its remarkable ability to understand and generate human-like text. The API enables developers to use this advanced technology for a variety of applications, including drafting emails, writing code, answering questions, creating written content, tutoring, language translation, and much more.\n\nNow, let's see how you can incorporate the power of OpenAI API into your applications using BlockEden.xyz. You can do it in three ways: using Python, using JavaScript (Node.js), or using curl directly from the command line. In this blog, we're going to provide the basic setup for each method, using a simple \"Hello, World!\" example.\n\nThe API key below is public and subject to change and rate limit. Get your own `BLOCKEDEN_API_KEY` from https://blockeden.xyz/dash instead.\n\n**Python**:\n\nUsing Python, you can use the OpenAI API as shown in the following snippet:\n\n```python\nimport openai\n\nBLOCKEDEN_API_KEY = \"8UuXzatAZYDBJC6YZTKD\"\nopenai.api_key = \"\"\nopenai.api_base = \"https://api.blockeden.xyz/openai/\" + BLOCKEDEN_API_KEY + \"/v1\"\n\nresponse = openai.ChatCompletion.create(\n  model=\"gpt-3.5-turbo-16k\",\n  messages=[{\"role\": \"user\", \"content\": \"hello, world!\"}],\n  temperature=0,\n  max_tokens=2048,\n  top_p=1,\n  frequency_penalty=0,\n  presence_penalty=0\n)\n\nprint(response[\"choices\"])\n```\n\n**JavaScript (Node.js)**:\n\nYou can also utilize the OpenAI API with JavaScript. Here's how you can do it:\n\n```js\nconst { Configuration, OpenAIApi } = require(\"openai\");\n\nconst BLOCKEDEN_API_KEY = \"8UuXzatAZYDBJC6YZTKD\";\nconst configuration = new Configuration({\n  basePath: \"https://api.blockeden.xyz/openai/\" + BLOCKEDEN_API_KEY + \"/v1\"\n});\nconst openai = new OpenAIApi(configuration);\n\n(async () => {\n  const response = await openai.createChatCompletion({\n    model: \"gpt-3.5-turbo-16k\",\n    messages: [{role: \"user\", content: \"hello, world!\"}],\n    temperature: 0,\n    max_tokens: 2048,\n    top_p: 1,\n    frequency_penalty: 0,\n    presence_penalty: 0,\n  });\n\n  console.log(JSON.stringify(response.data.choices, null, 2));\n})()\n```\n\n**cURL**:\n\nLast but not least, you can call the OpenAI API using curl directly from your terminal:\n\n```bash\ncurl https://api.blockeden.xyz/openai/8UuXzatAZYDBJC6YZTKD/v1/chat/completions \\\n  -H \"Content-Type: application/json\" \\\n  -d '{\n  \"model\": \"gpt-3.5-turbo-16k\",\n  \"messages\": [{\"role\": \"user\", \"content\": \"hello, world!\"}],\n  \"temperature\": 0,\n  \"max_tokens\": 2048,\n  \"top_p\": 1,\n  \"frequency_penalty\": 0,\n  \"presence_penalty\": 0\n}'\n```\n\nSo, what's next? Dive in, experiment, and discover how you can leverage the power of OpenAI API for your projects, be it for chatbots, content generation, or any other NLP-based application. The possibilities are as vast as your imagination. With BlockEden.xyz's seamless integration with OpenAI, let's redefine the boundaries of what's possible.\n\nFor more information on OpenAI's capabilities, models, and usage, visit the official [OpenAI documentation](https://beta.openai.com/docs/).\n\nHappy Coding!\n\n## **What is BlockEden.xyz**\n\nBlockEden.xyz is an API marketplace powering DApps of all sizes for Sui, Aptos, Solana, and 12 EVM blockchains. Why do our customers choose us?\n\n1. High availability. We maintain 99.9% uptime since our first API - Aptos main net launch.\n2. Inclusive API offerings and community. Our services have expanded to include Sui, Ethereum, IoTeX, Solana, Polygon, Polygon zkEVM, Filecoin, Harmony, BSC, Arbitrum, Optimism, Gnosis, Arbitrum Nova & EthStorage Galileo. Our community 10x.pub has 4000+ web3 innovators from Silicon Valley, Seattle, and NYC.\n3. Security. With over $45 million worth of tokens staked with us, our clients trust us to provide reliable and secure solutions for their web3 and blockchain needs.\n\nWe provide a comprehensive suite of services designed to empower every participant in the blockchain space, focusing on three key areas:\n\n- For blockchain **protocol builders**, we ensure robust security and decentralization by operating nodes and making long-term ecosystem contributions.\n- For **DApp developers**, we build user-friendly APIs to streamline development and unleash the full potential of decentralized applications.\n- For **token holders**, we offer a reliable staking service to maximize rewards and optimize asset management.\n\n----\n\n- Twitter: https://twitter.com/BlockEdenHQ\n- Discord: https://discord.gg/4Yfvs2HWey\n- Source Link: https://blockeden.xyz/blog/2023/07/19/unveiling-integration-openai-api-blockeden-api-marketplace/"
  },
  {
    "id": "/2023/07/14/beyond-boundaries-the-integration-of-near-protocol-into-blockedenxyzs-api-marketplace",
    "metadata": {
      "permalink": "/blog/2023/07/14/beyond-boundaries-the-integration-of-near-protocol-into-blockedenxyzs-api-marketplace",
      "source": "@site/blog/2023-07-14-beyond-boundaries-the-integration-of-near-protocol-into-blockedenxyzs-api-marketplace.mdx",
      "title": "Beyond Boundaries: The Integration of NEAR Protocol into BlockEden.xyz's API Marketplace",
      "description": "Discover the potent amalgamation of NEAR Protocol with BlockEden.xyz's innovative API Marketplace. Enable web3 developers to push the envelope of blockchain technology.",
      "date": "2023-07-14T00:00:00.000Z",
      "formattedDate": "July 14, 2023",
      "tags": [
        {
          "label": "product",
          "permalink": "/blog/tags/product"
        },
        {
          "label": "near",
          "permalink": "/blog/tags/near"
        }
      ],
      "readingTime": 3.3,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Beyond Boundaries: The Integration of NEAR Protocol into BlockEden.xyz's API Marketplace",
        "authors": [
          "dora"
        ],
        "tags": [
          "product",
          "near"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/near-protocol.png",
        "description": "Discover the potent amalgamation of NEAR Protocol with BlockEden.xyz's innovative API Marketplace. Enable web3 developers to push the envelope of blockchain technology."
      },
      "prevItem": {
        "title": "Unveiling the Integration of OpenAI ChatGPT API in BlockEden.xyz's API Marketplace",
        "permalink": "/blog/2023/07/19/unveiling-integration-openai-api-blockeden-api-marketplace"
      },
      "nextItem": {
        "title": "The Intricacies of QuickNode's Business Landscape",
        "permalink": "/blog/2023/07/09/quicknode"
      }
    },
    "content": "The surge in popularity of cryptocurrencies and blockchain technology have brought along significant scalability challenges. Blockchains like Bitcoin and Ethereum face heightened demand as the interest in decentralized applications (DApps) and non-fungible tokens (NFTs) increase. This has led to platforms like BlockEden.xyz, a software powerhouse based in San Francisco, to seek scalable solutions. Enter NEAR Protocol, an open-source platform launched in 2020 as a decentralized cloud infrastructure to host DApps.\n\n## A Brief Overview of NEAR Protocol\n\nNEAR Protocol is a layer-1 blockchain that uses Nightshade, a unique sharding technology, to achieve scalability. It offers cross-chain interoperability through the Rainbow Bridge and a layer-2 solution called Aurora. Users can bridge ERC-20 tokens and assets from the Ethereum blockchain to the NEAR Protocol network, enabling access to higher throughput and lower transaction fees. The native token of the NEAR Protocol, NEAR, is used for paying transaction and data storage fees. NEAR token holders can also stake their tokens on the NEAR wallet to receive rewards or use them to vote for governance proposals.\n\nThe team behind NEAR Protocol is on a mission to address scalability limitations through sharding. Co-founded by Alex Skidanov and Illia Polosukhin in 2020, NEAR Protocol features a wide range of programming tools and languages, along with smart contracts with cross-chain functionality. These tools and features, coupled with a simplified onboarding process and human-readable account names, make NEAR Protocol a developer-friendly platform.\n\n<div style={{ display: \"flex\", width: \"100%\", justifyContent: \"center\" }}>\n  <iframe\n    src=\"https://blockedenxyz.substack.com/embed\"\n    width=\"480\"\n    height=\"320\"\n    frameborder=\"0\"\n    scrolling=\"no\"\n  ></iframe>\n</div>\n\n\n## Integration of NEAR Protocol into BlockEden.xyz\n\nThe integration of NEAR Protocol into BlockEden.xyz's API marketplace offers developers a scalable, secure, and efficient platform for creating groundbreaking decentralized applications. BlockEden.xyz, already known for its robust security and impressive uptime record, has enhanced its offerings by introducing NEAR Protocol.\n\n## Understanding NEAR's Core Technology: Nightshade Sharding\n\nNightshade is the innovative sharding technology that forms the backbone of the NEAR Protocol. It enables the efficient processing of data by distributing the workload across multiple validator nodes. Each node handles only a fraction of the network’s transactions, allowing for a higher number of transactions per second. The dynamic adjustment of nodes based on network traffic ensures overall efficiency and low transaction fees.\n\n\n## Bridging Networks with Rainbow Bridge\n\nRainbow Bridge, an application on NEAR Protocol, enables the transfer of ERC-20 tokens, stablecoins, wrapped tokens, and even NFTs between Ethereum and NEAR blockchains. This allows users to benefit from the higher throughput and lower fees on the NEAR Protocol. The Rainbow Bridge operates in a fully permissionless and decentralized manner, locking tokens on Ethereum and creating corresponding tokens on NEAR to maintain a constant circulating supply.\n\n## Unleashing Efficiency with Aurora\n\nAurora, a layer-2 solution on the NEAR Protocol blockchain, is designed to host thousands of transactions per second with an approximate block confirmation time of 2 seconds. Comprising the Aurora Engine and the Aurora Bridge, it offers compatibility with Ethereum and supports all tools available in the Ethereum ecosystem, making it easy for developers to transition to NEAR.\n\n## Staking and Governance with NEAR Token\n\nNEAR, the native token of the NEAR ecosystem, serves as the medium for transaction and storage fees. Token holders can stake their NEAR to run validating nodes, participate in governance by voting on platform decisions, and submit proposals.\n\n## Conclusion\n\nThe blockchain space continues to evolve, and platforms offering lower transaction costs and increased throughput are likely to drive mainstream adoption. The integration of NEAR Protocol into BlockEden.xyz's API marketplace is not just a mere upgrade; it's a significant step towards that future. With scalable solutions like sharding and cross-chain bridges, NEAR Protocol provides the ideal environment for developers to build efficient DApps and DeFi products. Together with BlockEden.xyz, NEAR Protocol is set to redefine the boundaries of blockchain technology.\n\n<div style={{ display: \"flex\", width: \"100%\", justifyContent: \"center\" }}>\n  <iframe\n    src=\"https://blockedenxyz.substack.com/embed\"\n    width=\"480\"\n    height=\"320\"\n    frameborder=\"0\"\n    scrolling=\"no\"\n  ></iframe>\n</div>\n\n\n- Twitter: https://twitter.com/BlockEdenHQ\n- Discord: https://discord.gg/4Yfvs2HWey\n- Source Link: https://blockeden.xyz/blog/2023/07/14/beyond-boundaries-the-integration-of-near-protocol-into-blockedenxyzs-api-marketplace/"
  }
]