[
  {
    "id": "/2023/03/14/partnership-with-aptools",
    "metadata": {
      "permalink": "/blog/2023/03/14/partnership-with-aptools",
      "source": "@site/blog/2023-03-14-partnership-with-aptools.mdx",
      "title": "BlockEden.xyz and Aptools Partner to Strengthen the Aptos Developer Ecosystem",
      "description": "Aptos has been gaining traction over the past five months after the mainnet launch, and with its growth comes the need for more sophisticated tools and resources for developers. BlockEden.xyz and Aptools have recognized this need and have partnered to create a more robust blockchain developer ecosystem. In this blog post, we will introduce both companies and explain why our partnership matters.",
      "date": "2023-03-14T00:00:00.000Z",
      "formattedDate": "March 14, 2023",
      "tags": [
        {
          "label": "partnership",
          "permalink": "/blog/tags/partnership"
        },
        {
          "label": "aptos",
          "permalink": "/blog/tags/aptos"
        }
      ],
      "readingTime": 2.225,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "BlockEden.xyz and Aptools Partner to Strengthen the Aptos Developer Ecosystem",
        "authors": [
          "dora"
        ],
        "tags": [
          "partnership",
          "aptos"
        ],
        "image": "https://0x9C61566175E20204D7Ee56F5ca8F420136729fdA.w3q-g.w3link.io/blockeden-xyz-aptools-partnership.jpg"
      },
      "prevItem": {
        "title": "Boost Your Web3 Development with BlockEden.xyz/chat",
        "permalink": "/blog/2023/03/15/boost-your-web3-development-with-blockeden-xyz-chat"
      },
      "nextItem": {
        "title": "BlockEden.xyz Is Marching into IoT Territory",
        "permalink": "/blog/2023/02/20/iotex-validator-and-json-rpc"
      }
    },
    "content": "Aptos has been gaining traction over the past five months after the mainnet launch, and with its growth comes the need for more sophisticated tools and resources for developers. BlockEden.xyz and Aptools have recognized this need and have partnered to create a more robust blockchain developer ecosystem. In this blog post, we will introduce both companies and explain why our partnership matters.\n\n![BlockEden.xyz and Aptools Partner to Strengthen the Aptos Developer Ecosystem](https://0x9C61566175E20204D7Ee56F5ca8F420136729fdA.w3q-g.w3link.io/blockeden-xyz-aptools-partnership.jpg \"BlockEden.xyz and Aptools Partner to Strengthen the Aptos Developer Ecosystem\")\n\n<figcaption style={{textAlign: \"center\"}}>BlockEden.xyz · Aptools Partnership<br/> (image served from <a target=\"_blank\" href=\"https://blockeden.xyz/dstore/\">dStore</a>)</figcaption>\n\nBlockEden.xyz is a San Francisco-based software company that specializes in connecting web3 developers to blockchain nodes and networks. Its goal is to build an all-inclusive platform for web3 developers to make it easier for them to build decentralized applications. BlockEden.xyz has a team of experienced developers and blockchain experts who are committed to providing the best possible experience for its users.\n\nAptools, on the other hand, is an open-source project that provides developers with real-time data about the Aptos blockchain network. It is a valuable resource for developers who want to build decentralized applications on top of the Aptos blockchain. Aptools keeps track of the latest transactions for free and offers a user-friendly interface that developers can easily navigate.\n\n- Twitter: https://twitter.com/AptoolsExplorer\n- Blockchain Explorer: https://aptools.io/\n\nThe partnership between BlockEden.xyz and Aptools is significant because it brings together two companies that have complementary strengths. BlockEden.xyz's expertise in blockchain connectivity will enable developers to access real-time data from the Aptos blockchain network seamlessly. This integration will allow developers to build more efficient and effective decentralized applications.\n\nMoreover, the partnership will help both companies expand their reach and establish a stronger presence in the Aptos community. Aptools has a large and active community of developers who are already using its platform. By collaborating with Aptools, BlockEden.xyz can tap into this community and introduce its services to a wider audience. On the other hand, Aptools can benefit from BlockEden.xyz's expertise in blockchain technology, which can help them improve their platform and offer more advanced features to their users.\n\nIn conclusion, the partnership between BlockEden.xyz and Aptools is a strategic move that will benefit both companies and the Aptos community. By leveraging each other's strengths, they can create a more robust ecosystem for web3 developers. The partnership will enable developers to access real-time data from the Aptos blockchain network seamlessly, which will help them build more efficient and effective decentralized applications. We can expect to see more collaborations like this in the future as companies recognize the value of partnerships in the Aptos blockchain space.\n\n- Twitter: https://twitter.com/BlockEdenHQ\n- Discord: https://discord.gg/4Yfvs2HWey\n- Source Link: https://blockeden.xyz/blog/2023/03/14/partnership-with-aptools/"
  },
  {
    "id": "/2023/01/04/how-to-pay-blockeden-xyz-with-apt",
    "metadata": {
      "permalink": "/blog/2023/01/04/how-to-pay-blockeden-xyz-with-apt",
      "source": "@site/blog/2023-01-04-how-to-pay-blockeden-xyz-with-apt.mdx",
      "title": "How to Pay BlockEden.xyz with APT, USDC, USDT on Aptos",
      "description": "Are you looking for an easy way to pay for your subscription to BlockEden's API service? Look no further! We are happy to announce that we accept APT as a payment method.",
      "date": "2023-01-04T00:00:00.000Z",
      "formattedDate": "January 4, 2023",
      "tags": [
        {
          "label": "company",
          "permalink": "/blog/tags/company"
        },
        {
          "label": "product",
          "permalink": "/blog/tags/product"
        },
        {
          "label": "aptos",
          "permalink": "/blog/tags/aptos"
        }
      ],
      "readingTime": 2.455,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "How to Pay BlockEden.xyz with APT, USDC, USDT on Aptos",
        "authors": [
          "dora"
        ],
        "tags": [
          "company",
          "product",
          "aptos"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/how-to-pay-blockeden-xyz-with-apt.png"
      },
      "prevItem": {
        "title": "BlockEden.xyz and Vital Block partner up to create a safer blockchain space",
        "permalink": "/blog/2023/01/11/blockeden-xyz-and-vital-block-parterner-up"
      },
      "nextItem": {
        "title": "Introducing BlockEden.xyz Analytics",
        "permalink": "/blog/2022/12/30/introducing-blockEden-xyz-analytics"
      }
    },
    "content": "Are you looking for an easy way to pay for your subscription to BlockEden's API service? Look no further! We are happy to announce that we accept APT as a payment method.\n\nAPT is the token of the Aptos blockchain, and it's a great way to pay for our products. Soon, we will also be accepting SUI when Sui mainnet launches. Read on to learn how you can pay for our services with APT!\n\n![How to Pay BlockEden.xyz with APT, USDC, USDT on Aptos](https://tp-misc.b-cdn.net/blockeden/how-to-pay-blockeden-xyz-with-apt.png \"How to Pay BlockEden.xyz with APT, USDC, USDT on Aptos\")\n\n**Step 1: Get Your APT Wallet Ready**\n\nBefore you can pay for your subscription with APT, you will need an APT wallet. You can get any wallet that supports Aptos, like [Pontem](https://pontem.network/). Once you have a wallet, make sure it has enough funds to cover the subscription cost. You can transfer money from other wallets or buy more tokens directly from exchanges like Coinbase, [Hippo.space](https://hippo.space/) or [LiquidSwap](https://liquidswap.com/#/).\n\n**Step 2: Go to Our Website and Select the Subscription Plan**\n\nOnce your wallet is ready, go to BlockEden. xyz's website https://blockeden.xyz/pricing/ and select the best plan for your needs. Then, click *Pay with crypto* and select *APT* over the *Aptos* network as your payment method. This will generate an address with a QR code containing the recipient's address. Please send the **exact amount of coins** to the listed address. Once this is done, you will see *Payment succeeded* and click the button to get back to the dashboard.\n\n**Step 3: Confirm Your Payment**\n\nWhen you have completed the transaction, recheck your wallet balance and ensure that the correct amount has been deducted. If everything looks good, then congratulations! You have successfully paid for your subscription using APT tokens! Now all that's left is to start using our services and enjoy all of their benefits!\n\nPaying for BlockEden. xyz's services with APT tokens is both fast and secure. With just three steps—getting a wallet ready, selecting a plan on our website, and confirming payment—you can subscribe to our services quickly and easily without having to worry about security risks or waiting times associated with other payment methods like credit cards or bank transfers. So what are you waiting for? Start subscribing today with BlockEden.xyz and pay securely with APT tokens!\n\n## What is BlockEden.xyz?\n\nBlockEden.xyz provides a set of APIs that makes it easy for developers to connect to the Aptos and Sui networks. As a result, our platform enables developers to quickly and securely build decentralized applications (DApps). In addition, we offer tools that help developers to query those blockchains with SQL and GraphQL.\n\nWe believe that our platform will help to accelerate the development of the Aptos and Sui ecosystems. We aim to make it easy for developers to build DApps on Aptos and Sui, so that more people can use these blockchains to fulfill their decentralized needs.\n\n- Twitter: https://twitter.com/BlockEdenHQ\n- Discord: https://discord.gg/4Yfvs2HWey\n- Source Link: https://blockeden.xyz/blog/2023/01/04/how-to-pay-blockeden-xyz-with-apt/"
  },
  {
    "id": "/2022/12/30/introducing-blockEden-xyz-analytics",
    "metadata": {
      "permalink": "/blog/2022/12/30/introducing-blockEden-xyz-analytics",
      "source": "@site/blog/2022-12-30-introducing-blockEden-xyz-analytics.mdx",
      "title": "Introducing BlockEden.xyz Analytics",
      "description": "BlockEden.xyz Analytics is a metabase for exploring and analyzing blockchain data. It allows users to easily query, visualize, and share data from Aptos and Sui blockchains.",
      "date": "2022-12-30T00:00:00.000Z",
      "formattedDate": "December 30, 2022",
      "tags": [
        {
          "label": "company",
          "permalink": "/blog/tags/company"
        },
        {
          "label": "product",
          "permalink": "/blog/tags/product"
        },
        {
          "label": "aptos",
          "permalink": "/blog/tags/aptos"
        }
      ],
      "readingTime": 1.955,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Introducing BlockEden.xyz Analytics",
        "authors": [
          "dora"
        ],
        "tags": [
          "company",
          "product",
          "aptos"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/BlockEden-xyz-analytics-share-dashboard.png"
      },
      "prevItem": {
        "title": "How to Pay BlockEden.xyz with APT, USDC, USDT on Aptos",
        "permalink": "/blog/2023/01/04/how-to-pay-blockeden-xyz-with-apt"
      },
      "nextItem": {
        "title": "Sui WebSocket now available at BlockEden.xyz",
        "permalink": "/blog/2022/12/27/supporting-sui-ws"
      }
    },
    "content": "BlockEden.xyz Analytics is a metabase for exploring and analyzing blockchain data. It allows users to easily query, visualize, and share data from Aptos and Sui blockchains.\n\nOne of the key features of BlockEden.xyz Analytics is its user-friendly interface. It is designed to be accessible to users of all skill levels, from beginners to experienced analysts. This makes it an ideal tool for anyone looking to gain insights into the data on blockchain networks.\n\n![BlockEden.xyz Analytics](https://tp-misc.b-cdn.net/blockeden/BlockEden-xyz-analytics.png \"BlockEden.xyz Analytics\")\n\n\n\nOne of the primary uses of BlockEden.xyz Analytics is for exploring on-chain data. This can include information about transactions, token transfers, and smart contract interactions. With BlockEden.xyz Analytics, users can quickly and easily query this data using a simple SQL-like language. They can then visualize the data using a variety of charts and graphs, making it easy to identify trends and patterns.\n\n![BlockEden.xyz Analytics: Explore Table](https://tp-misc.b-cdn.net/blockeden/BlockEden-xyz-analytics-explore-table.png \"BlockEden.xyz Analytics: Explore Table\")\n\nAnother useful feature of BlockEden.xyz Analytics is the ability to share data and analysis with others. Users can create and share dashboards, allowing them to collaborate with others and share their insights with the broader community. This can be especially useful for teams working on blockchain projects, as it allows them to easily share and discuss data and analysis.\n\n\n\n![BlockEden.xyz Analytics Dashboard](https://tp-misc.b-cdn.net/blockeden/BlockEden-xyz-analytics-share-dashboard.png \"BlockEden.xyz Analytics Dashboard\")\n\n\n\nIn summary, blockEden.xyz Analytics is a powerful tool for exploring and analyzing blockchain data. Its user-friendly interface and ability to query, visualize, and share data make it an invaluable resource for anyone looking to gain insights into the world of blockchain, starting from Aptos and Sui.\n\n* Get started to explore the analytics dashboard at https://blockeden.xyz/analytics\n* Check documentations for [Aptos Analytics and GraphQL](/docs/aptos/analytics-and-graphql/)\n\n## Why BlockEden.xyz?\n\nWe listen to Aptos and Sui developers every day and are fully committed to serving the best infra for them.\n\nIf you’re a Web3 developer or app owner in need of an RPC connection for the Sui devnet, look no further than BlockEden.xyz! We are proud to be one of the first infrastructure providers offering this service for this highly anticipated new blockchains. In addition to our RPC connection, we will also offer a variety of other essential services and features for any Web3 project. Learn more about us today and see how we can help you succeed in the blockchain space!\n\n- Twitter: https://twitter.com/BlockEdenHQ\n- Discord: https://discord.gg/4Yfvs2HWey\n- Source Link: https://blockeden.xyz/blog/2022/12/30/introducing-blockEden-xyz-analytics/"
  }
]