[
  {
    "id": "/2023/09/05/pay-api-usage-with-compute-unit-credit",
    "metadata": {
      "permalink": "/blog/2023/09/05/pay-api-usage-with-compute-unit-credit",
      "source": "@site/blog/2023-09-05-pay-api-usage-with-compute-unit-credit.md",
      "title": "Introducing Pay-As-You-Go Pricing and Changes in Pricing Plans",
      "description": "Learn about BlockEden.xyz's updated pricing plans and the introduction of our Pay-As-You-Go option with Compute Unit Credit (CUC). We're committed to providing cost-effective and flexible solutions tailored to indie developers, small businesses, and venture-backed companies. Discover our expanded API offerings, high availability, robust security, and more. Join our community of over 4000 web3 innovators today.",
      "date": "2023-09-05T00:00:00.000Z",
      "formattedDate": "September 5, 2023",
      "tags": [
        {
          "label": "product",
          "permalink": "/blog/tags/product"
        }
      ],
      "readingTime": 4.19,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Introducing Pay-As-You-Go Pricing and Changes in Pricing Plans",
        "authors": [
          "dora"
        ],
        "tags": [
          "product"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/introducing-pay-as-you-go-pricing-and-plan-changes.png",
        "description": "Learn about BlockEden.xyz's updated pricing plans and the introduction of our Pay-As-You-Go option with Compute Unit Credit (CUC). We're committed to providing cost-effective and flexible solutions tailored to indie developers, small businesses, and venture-backed companies. Discover our expanded API offerings, high availability, robust security, and more. Join our community of over 4000 web3 innovators today."
      },
      "nextItem": {
        "title": "Intent-Centric Protocols",
        "permalink": "/blog/2023/08/30/embracing-intent-centric-protocols-web3-revolution"
      }
    },
    "content": "> **💵 TL;DR**\n>\n> 1. We've increased the rate limit by 5x for all plans.\n> 2. For improved granularity, 1 CU has been updated to 100 CU.\n> 3. Announcing our new \"Basic\" plan priced at $19.99.\n> 4. CUs are now denominated in CUC and are refreshed daily. Monitor your balance at [blockeden.xyz/dash/account](blockeden.xyz/dash/account).\n> 5. With our updated plans, extra CUCs beyond those plans allow you to access extra API calls using a pay-as-you-go system every day.\n\n\n\nBlockEden.xyz is committed to providing cost-effective and efficient solutions to indie developers, small businesses, and venture-backed companies. Our customer feedback revealed a few key insights:\n\n1. A requirement for an intermediate tier between the Free and Pro plans.\n2. A desire for a more flexible 'pay-as-you-go' option.\n3. An opportunity for us to accommodate more requests through a more efficient infrastructure.\n\nBased on these insights, we're excited to announce the introduction of a pay-as-you-go feature using Compute Unit Credit (CUC), and to share details about modifications to our pricing plans.\n\n## **Understanding Compute Units and Compute Unit Credit**\n\nA **Compute Unit** (CU) serves as a standard measurement that quantifies the computational expense incurred during an API call. It's akin to how AWS charges for compute usage. The computational cost varies depending on the intensity of the queries – some are lightweight and fast (e.g., eth_blockNumber) while others can be more demanding (e.g., large eth_getLogs queries). The cost in CU for each request across different products can be found in our[ API marketplace](https://blockeden.xyz/api-marketplace).\n\n**Compute Unit Credits** (CUC) are like credit card rewards on our platform to serve as royalty points. Those points are identical to compute units. Developers could spend CUC on our platform to get extra quotas for API calls.\n\n## **Implementing Pay-As-You-Go with CUC**\n\nWe'll set up a reward account for each customer. Customers can load this account with CUC, which will then be consumed as per their API usage.\n\n- For the Free tier, we ensure a minimum balance of 0.3 CUC at the start of each month.\n- For the paid tiers (Basic, Pro, Enterprise 50), we will credit the account on each subscription or renewal.\n\nWe do not allow customer to withdraw CUC for now.\n\nThe credits on BlockEden.xyz will be reconciled daily and also each time a withdrawal or deposit is made. **BlockEden.xyz maintains the rights to the Compute Units (CU) on our platform, along with the authority to clarify the application of the API and the usage of credits**.\n\n## **Pricing Plan Modifications**\n\nBelow are the changes to our pricing plans. The original pricing structure was as follows:\n\n|                    | **Free**    | **Pro**   | **Enterprise 50** | **Enterprise 500** |\n| ------------------ | ----------- | --------- | ----------------- | ------------------ |\n| Price              | 0           | 49.99     | 200               | 1999               |\n| CU / day           | 0.1 Million | 1 Million | 4.32 Million      | 50 Million         |\n| Price / Million CU | 0           | 1.66      | 1.54              | 1.33               |\n| Ratelimit req/s    | 1           | 10        | 50                | 500                |\n| Project allowed    | 15          | 30        | 100               | 300                |\n\nIn response to customer feedback, we've made the following adjustments:\n\n1. The \"Enterprise 500\" tier has been discontinued, and a \"Basic\" tier has been introduced to offer indie developers more flexibility.\n2. Rate limits have been increased five-fold for almost all plans.\n\nHere is our updated pricing structure:\n\n| **Plan**           | **Free**   | **Basic**  | **Pro**     | **Enterprise 50** |\n| ------------------ | ---------- | ---------- | ----------- | ----------------- |\n| Price              | 0          | 19.99      | 49.99       | 199.99            |\n| CU / day           | 10 Million | 40 Million | 100 Million | 513.33 Million    |\n| Price / Million CU | 0          | 0.0167     | 0.0167      | 0.0130            |\n| Ratelimit CU/s     | 1,000      | 10,000     | 10,000      | 500,000           |\n| Ratelimit req/s    | 5          | 50         | 50          | 250               |\n| Project allowed    | 15         | 30         | 100         | 300               |\n\n## **Why Choose BlockEden.xyz**\n\nBlockEden.xyz is a comprehensive API marketplace that powers DApps for a variety of blockchain ecosystems. Our customers opt for us due to:\n\n1. **High Availability:** Our 99.9% uptime record since our first API launch attests to our reliability.\n2. **Diverse API Offerings and Community:** Our service portfolio has expanded to cover numerous blockchains, with a community of over 4000 web3 innovators.\n3. **Robust Security:** With over $45 million worth of tokens staked, clients trust our secure solutions for their web3 and blockchain needs.\n\nWe focus on empowering every participant in the blockchain ecosystem with a suite of tailored services:\n\n- For **protocol builders**, we guarantee robust security and decentralization by operating nodes and contributing to the ecosystem.\n- For **DApp developers**, we provide user-friendly APIs that streamline development and unlock the power of decentralized applications.\n- For **token holders**, we offer a reliable staking service to optimize rewards and asset management.\n\n\n\n------\n\n\n\n- Twitter:[ https://twitter.com/BlockEdenHQ](https://twitter.com/BlockEdenHQ)\n- Discord:[ https://discord.gg/4Yfvs2HWey](https://discord.gg/4Yfvs2HWey)\n- Source Link: https://blockeden.xyz/blog/2023/08/13/pay-api-usage-with-compute-unit-credit/"
  },
  {
    "id": "/2023/08/30/embracing-intent-centric-protocols-web3-revolution",
    "metadata": {
      "permalink": "/blog/2023/08/30/embracing-intent-centric-protocols-web3-revolution",
      "source": "@site/blog/2023-08-30-embracing-intent-centric-protocols-web3-revolution.mdx",
      "title": "Intent-Centric Protocols",
      "description": "Explore the transformative world of intent-centric protocols in Web3. Discover how they're enhancing user experience, promoting seamless integrations, and ensuring user privacy. From the daily user to the tech-savvy, everyone stands to benefit in this decentralized digital evolution.",
      "date": "2023-08-30T00:00:00.000Z",
      "formattedDate": "August 30, 2023",
      "tags": [
        {
          "label": "investment research",
          "permalink": "/blog/tags/investment-research"
        }
      ],
      "readingTime": 2.665,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Intent-Centric Protocols",
        "authors": [
          "dora"
        ],
        "tags": [
          "investment research"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/embracing-intent-centric-protocols-web3-revolution.png",
        "description": "Explore the transformative world of intent-centric protocols in Web3. Discover how they're enhancing user experience, promoting seamless integrations, and ensuring user privacy. From the daily user to the tech-savvy, everyone stands to benefit in this decentralized digital evolution."
      },
      "prevItem": {
        "title": "Introducing Pay-As-You-Go Pricing and Changes in Pricing Plans",
        "permalink": "/blog/2023/09/05/pay-api-usage-with-compute-unit-credit"
      },
      "nextItem": {
        "title": "Y Combinator’s Crypto Portfolio: A Glimpse into YC's Future Imagination of Web3",
        "permalink": "/blog/2023/08/19/y-combinators-crypto-portfolio"
      }
    },
    "content": "In the evolving landscape of Web3, a new approach to user interactions is emerging – the intent-centric protocol. Here, users simply **express what they want**, leaving the intricate process of how it's achieved to the system. This approach heralds enhanced user experience, better composability, and greater privacy.\n\n### The Three Pillars of Intent-Centricity\n\n1. **User-Centric Interaction**: The essence of intent-centricity lies in streamlining user experience. By emphasizing the \"what\" over the \"how,\" it spares users the need to grapple with complex underlying mechanisms. The result? A straightforward expression of their objectives.\n\n2. **Robust Composability**: In the realm of Web3, composability denotes the ease with which various protocols or apps integrate and build upon each other. When users solely voice their intent, it provides room for systems to be tailored for maximized compatibility, fostering richer and more cohesive digital ecosystems.\n\n3. **Privacy by Design**: Expressing just the intent can obviate the need for users to disclose detailed or sensitive data about themselves. This is a major stride towards ensuring user privacy in blockchain interactions.\n\n### Let's Paint a Picture\n\nConsider Alice – a newcomer to the DeFi (Decentralized Finance) world with minimal technical expertise. She's just dipped her toes into the realm of cryptocurrency and is curious about staking to earn interest.\n\n| **Traditional Protocol** | **Intent-Centric Protocol** |\n|--------------------------|-----------------------------|\n| 1. Alice starts by selecting a staking platform.<br/>2. She grapples with its intricacies.<br/>3. She's faced with choices: locked staking or flexible?<br/>4. Next, she must comprehend the risks linked to her choice.<br/>5. Finally, after a labyrinthine process, she stakes her cryptocurrency. | 1. Alice accesses a Web3 app.<br/>2. She straightforwardly states: \"I wish to stake X crypto and earn interest.\"<br/>3. The protocol, cognizant of her intent, optimizes the staking method for her – considering market dynamics, her stake, and more.<br/>4. Behind the scenes, it liaises with the required DeFi protocols, managing the technicalities.<br/>5. Alice gets an affirmation: her cryptocurrency is staked and interest earnings are on the way. |\n\nFor Alice, the intent-centric approach is a breath of fresh air. She’s spared the technical maze and instead, expresses her intent. The protocol does the heavy lifting, ensuring her privacy and sourcing the best available options.\n\n### What Fuels the Rise of Intent-Centricity?\n\nThe rising wave of intent-centricity is spurred by a blend of the AIGC revolution, developments like EIP4337 (smart contract accounts), and the push to make Web3 accessible to all.\n\nA testament to this trend is the project showcased at ETHGlobal Paris 2023: [**Bob the Solver** - Pioneering infrastructure for intent-based transactions to elevate the UX of wallets and dapps](https://ethglobal.com/showcase/bob-the-solver-yxtgp).\n\n![Bob the solver](https://tp-misc.b-cdn.net/blockeden/Bob-the-Solver.png \"Bob the solver\")\n\n## Summary\n\nAs the digital realm advances, user-centric approaches like intent-centric protocols are shaping the future of Web3 interactions. By shifting the focus from intricate processes to straightforward intent expression, these protocols are democratizing access, enhancing user experience, and promoting privacy. With innovations such as Bob the Solver leading the charge, the Web3 space is poised to become more inclusive and user-friendly, bridging the gap between the technical and the everyday user. Embracing intent-centricity is not just the next step; it's the future of decentralized digital interactions.\n\n\n- Twitter: https://twitter.com/BlockEdenHQ\n- Discord: https://discord.gg/4Yfvs2HWey\n- Source Link: https://blockeden.xyz/blog/2023/08/30/embracing-intent-centric-protocols-web3-revolution/"
  },
  {
    "id": "/2023/08/19/y-combinators-crypto-portfolio",
    "metadata": {
      "permalink": "/blog/2023/08/19/y-combinators-crypto-portfolio",
      "source": "@site/blog/2023-08-19-y-combinators-crypto-portfolio.md",
      "title": "Y Combinator’s Crypto Portfolio: A Glimpse into YC's Future Imagination of Web3",
      "description": "Y Combinator, the renowned startup accelerator, has been at the forefront of spotting trends and supporting early-stage startups. One of the segments where YC has shown keen interest is the world of Web3 and cryptocurrencies. Let's dive into YC’s crypto portfolio and explore some of the game-changing companies leading the Web3 movement.",
      "date": "2023-08-19T00:00:00.000Z",
      "formattedDate": "August 19, 2023",
      "tags": [
        {
          "label": "investment research",
          "permalink": "/blog/tags/investment-research"
        }
      ],
      "readingTime": 2.855,
      "hasTruncateMarker": false,
      "authors": [
        {
          "name": "Dora Noda",
          "title": "Software Engineer",
          "url": "https://github.com/doranoda",
          "imageURL": "https://avatars.githubusercontent.com/u/38552114?v=4",
          "key": "dora"
        }
      ],
      "frontMatter": {
        "title": "Y Combinator’s Crypto Portfolio: A Glimpse into YC's Future Imagination of Web3",
        "authors": [
          "dora"
        ],
        "tags": [
          "investment research"
        ],
        "image": "https://tp-misc.b-cdn.net/blockeden/y-combinators-crypto-portfolio.png"
      },
      "prevItem": {
        "title": "Intent-Centric Protocols",
        "permalink": "/blog/2023/08/30/embracing-intent-centric-protocols-web3-revolution"
      },
      "nextItem": {
        "title": "[40 min read] Regulatory Storm: Dilemma and Opportunities in the Crypto Industry",
        "permalink": "/blog/2023/08/02/regulatory-storm-dilemma-opportunities-in-the-us-crypto-industry"
      }
    },
    "content": "Y Combinator, the renowned startup accelerator, has been at the forefront of spotting trends and supporting early-stage startups. One of the segments where YC has shown keen interest is the world of Web3 and cryptocurrencies. Let's dive into YC’s crypto portfolio and explore some of the game-changing companies leading the Web3 movement.\n\n[![](https://tp-misc.b-cdn.net/blockeden/yc-dapp-collection.png)](https://blockeden.xyz/dapp/y-combinator/)\n\n### **Key Players:**\n\n1. **Coinbase:** Arguably the most famous company in the list, Coinbase has become synonymous with the world of digital currencies. As a robust digital currency wallet and platform, it’s paving the way for mainstream adoption.\n2. **OpenSea:** The NFT marketplace, which has seen significant growth, is a testament to the way OpenSea has captured the market.\n3. **Protocol Labs:** The brainchild behind decentralized file systems like IPFS and initiatives like Filecoin, showing the power of distributed systems.\n4. **Rainbow:** Simplifying Ethereum wallet management and making crypto transactions user-friendly.\n\n### **Noteworthy Themes:**\n\n1. **Financial Infrastructure:** Companies like TRM Labs, SFOX, QuickNode, and Excheqr are reinforcing the financial structures, ensuring fraud detection, liquidity provision, and overall financial health.\n\n2. **Neobanks and Payment Solutions:** Littio, Wallbit Pay, and Ping are examples of neobanks and platforms aiding in easy cross-border payments and international banking solutions, particularly tailored for specific demographics like Latin Americans.\n\n3. **Security and Data Management:** Quantstamp, Spruce Systems, and Blyss are working to ensure the security of transactions and data in a decentralized world.\n\n4. **Developer Tools and Infrastructure:** Hiro Systems, WalletKit, Cedalio, and Stackup provide the necessary tools for developers to build on the decentralized internet seamlessly.\n\n5. **Decentralized Finance (DeFi):** EthosX, Algofi, and Meson are just some of the platforms redefining the financial system using blockchain technology.\n\n6. **Adoption and User Experience:** Platforms like Proxy, Notebook Labs, and Lyra are dedicated to making blockchain and crypto interactions seamless for users, reducing the existing friction in using these technologies.\n\n7. **NFT & Creative Monetization:** Hypeshot and Winter showcase the evolution of how creators can monetize their content, especially with the rise of NFTs.\n\n8. **Localized Solutions:** Several startups like Botin, Valiu, and Tienda Crypto are focused on specific regional challenges, providing tailored solutions to Latin America, Africa, and other areas, signifying the global appeal of blockchain solutions.\n\n### **Insights:**\n\n1. **Broadening Horizons:** The variety in YC's crypto portfolio indicates that the applications of blockchain are no longer limited to just finance but are branching into diverse sectors, from content creation to governance.\n\n2. **Local & Global:** While some startups are addressing global challenges, there's a strong focus on localized solutions, recognizing the unique challenges and opportunities presented by different regions.\n\n3. **User-Centricity:** A majority of these startups aim to simplify crypto and Web3 for users, whether it's through user-friendly wallets, neobanks, or investment platforms. The emphasis is clear: to bring more users into the fold, the experience needs to be simplified.\n\n4. **Safety First:** As the ecosystem grows, so does the need for security and fraud prevention. There’s a clear emphasis on ensuring transactions are secure, data is protected, and the ecosystem remains safe for all users.\n\nIn conclusion, Y Combinator’s portfolio offers a comprehensive look into the evolving Web3 landscape. From fundamental infrastructure builders to consumer-facing applications, the accelerator's companies are collectively shaping a decentralized, user-centric, and secure future for the internet. The next wave of internet evolution is here, and it’s evident that YC-backed startups are at its helm.\n\n\n> 🔥 Visit [List of 106 Y Combinator projects](https://blockeden.xyz/dapp/y-combinator/) to check those individual projects."
  }
]